[NoCoverage] BlockStatement
src/utils/ApiClient.js:14:57
  *
  * @param {Boolean} [redirect] Whether to redirect to the login page.
  */
-PocketBase.prototype.logout = function(redirect = true) {
-    this.authStore.clear();
-
-    if (redirect) {
-        replace('/login');
-    }
-};
+PocketBase.prototype.logout = function(redirect = true) {};
 
 /**

[NoCoverage] BooleanLiteral
src/utils/ApiClient.js:14:51
  *
  * @param {Boolean} [redirect] Whether to redirect to the login page.
  */
-PocketBase.prototype.logout = function(redirect = true) {
+PocketBase.prototype.logout = function(redirect = false) {
     this.authStore.clear();
 

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:17:9
 PocketBase.prototype.logout = function(redirect = true) {
     this.authStore.clear();
 
-    if (redirect) {
+    if (false) {
         replace('/login');
     }

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:17:9
 PocketBase.prototype.logout = function(redirect = true) {
     this.authStore.clear();
 
-    if (redirect) {
+    if (true) {
         replace('/login');
     }

[NoCoverage] BooleanLiteral
src/utils/ApiClient.js:29:68
  * @param  {Boolean} notify     Whether to add a toast notification.
  * @param  {String}  defaultMsg Default toast notification message if the error doesn't have one.
  */
-PocketBase.prototype.errorResponseHandler = function(err, notify = true, defaultMsg = '') {
+PocketBase.prototype.errorResponseHandler = function(err, notify = false, defaultMsg = '') {
     if (!err || !(err instanceof Error) || err.isAbort) {
         return;

[NoCoverage] BlockStatement
src/utils/ApiClient.js:30:57
  * @param  {String}  defaultMsg Default toast notification message if the error doesn't have one.
  */
 PocketBase.prototype.errorResponseHandler = function(err, notify = true, defaultMsg = '') {
-    if (!err || !(err instanceof Error) || err.isAbort) {
-        return;
-    }
+    if (!err || !(err instanceof Error) || err.isAbort) {}
 
     const statusCode = (err?.status << 0) || 400;

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:30:9
  * @param  {String}  defaultMsg Default toast notification message if the error doesn't have one.
  */
 PocketBase.prototype.errorResponseHandler = function(err, notify = true, defaultMsg = '') {
-    if (!err || !(err instanceof Error) || err.isAbort) {
+    if (false) {
         return;
     }

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:34:24
         return;
     }
 
-    const statusCode = (err?.status << 0) || 400;
+    const statusCode = false;
     const responseData = err?.data || {};
 

[NoCoverage] LogicalOperator
src/utils/ApiClient.js:34:24
         return;
     }
 
-    const statusCode = (err?.status << 0) || 400;
+    const statusCode = err?.status << 0 && 400;
     const responseData = err?.data || {};
 

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:35:26
     }
 
     const statusCode = (err?.status << 0) || 400;
-    const responseData = err?.data || {};
+    const responseData = true;
 
     // add toast error notification

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:35:26
     }
 
     const statusCode = (err?.status << 0) || 400;
-    const responseData = err?.data || {};
+    const responseData = false;
 
     // add toast error notification

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:39:9
 
     // add toast error notification
     if (
-        notify &&          // notifications are enabled
-        statusCode !== 404 // is not 404
+        true // is not 404
     ) {
         let msg = responseData.message || err.message || defaultMsg;

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:39:9
 
     // add toast error notification
     if (
-        notify &&          // notifications are enabled
-        statusCode !== 404 // is not 404
+        false // is not 404
     ) {
         let msg = responseData.message || err.message || defaultMsg;

[NoCoverage] EqualityOperator
src/utils/ApiClient.js:40:9
     // add toast error notification
     if (
         notify &&          // notifications are enabled
-        statusCode !== 404 // is not 404
+        // notifications are enabled
+statusCode === 404 // is not 404
     ) {
         let msg = responseData.message || err.message || defaultMsg;

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:40:9
     // add toast error notification
     if (
         notify &&          // notifications are enabled
-        statusCode !== 404 // is not 404
+        true // is not 404
     ) {
         let msg = responseData.message || err.message || defaultMsg;

[NoCoverage] BlockStatement
src/utils/ApiClient.js:41:7
     if (
         notify &&          // notifications are enabled
         statusCode !== 404 // is not 404
-    ) {
-        let msg = responseData.message || err.message || defaultMsg;
-        if (msg) {
-            addErrorToast(msg);
-        }
-    }
+    ) {}
 
     // populate form field errors

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:42:19
         notify &&          // notifications are enabled
         statusCode !== 404 // is not 404
     ) {
-        let msg = responseData.message || err.message || defaultMsg;
+        let msg = true;
         if (msg) {
             addErrorToast(msg);

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:42:19
         notify &&          // notifications are enabled
         statusCode !== 404 // is not 404
     ) {
-        let msg = responseData.message || err.message || defaultMsg;
+        let msg = false;
         if (msg) {
             addErrorToast(msg);

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:43:13
         statusCode !== 404 // is not 404
     ) {
         let msg = responseData.message || err.message || defaultMsg;
-        if (msg) {
+        if (false) {
             addErrorToast(msg);
         }

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:43:13
         statusCode !== 404 // is not 404
     ) {
         let msg = responseData.message || err.message || defaultMsg;
-        if (msg) {
+        if (true) {
             addErrorToast(msg);
         }

[NoCoverage] BooleanLiteral
src/utils/ApiClient.js:49:9
     }
 
     // populate form field errors
-    if (!CommonHelper.isEmpty(responseData.data)) {
+    if (CommonHelper.isEmpty(responseData.data)) {
         setErrors(responseData.data);
     }

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:49:9
     }
 
     // populate form field errors
-    if (!CommonHelper.isEmpty(responseData.data)) {
+    if (false) {
         setErrors(responseData.data);
     }

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:54:9
     }
 
     // unauthorized
-    if (statusCode === 401) {
+    if (true) {
         this.cancelAllRequests();
         return this.logout();

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:54:9
     }
 
     // unauthorized
-    if (statusCode === 401) {
+    if (false) {
         this.cancelAllRequests();
         return this.logout();

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:60:9
     }
 
     // forbidden
-    if (statusCode === 403) {
+    if (false) {
         this.cancelAllRequests();
         return replace('/');

[NoCoverage] BlockStatement
src/utils/ApiClient.js:60:29
     }
 
     // forbidden
-    if (statusCode === 403) {
-        this.cancelAllRequests();
-        return replace('/');
-    }
+    if (statusCode === 403) {}
 };
 

[NoCoverage] BlockStatement
src/utils/ApiClient.js:71:24
     /**
      * @inheritdoc
      */
-    save(token, model) {
-        super.save(token, model);
-
-        if (model instanceof Admin) {
-            setAdmin(model);
-        }
-    }
+    save(token, model) {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:74:13
     save(token, model) {
         super.save(token, model);
 
-        if (model instanceof Admin) {
+        if (true) {
             setAdmin(model);
         }

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:74:13
     save(token, model) {
         super.save(token, model);
 
-        if (model instanceof Admin) {
+        if (false) {
             setAdmin(model);
         }

[NoCoverage] BlockStatement
src/utils/ApiClient.js:82:13
     /**
      * @inheritdoc
      */
-    clear() {
-        super.clear();
-
-        setAdmin(null);
-    }
+    clear() {}
 }
 

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:94:5
     new AppAuthStore("pb_admin_auth")
 );
 
-if (client.authStore.model instanceof Admin) {
+if (false) {
     setAdmin(client.authStore.model);
 }

[NoCoverage] ConditionalExpression
src/utils/ApiClient.js:94:5
     new AppAuthStore("pb_admin_auth")
 );
 
-if (client.authStore.model instanceof Admin) {
+if (true) {
     setAdmin(client.authStore.model);
 }
