[Killed] ArrayDeclaration
src/utils/CommonHelper.js:3:25
 import { DateTime } from "luxon";
 
-const imageExtensions = [
-   ".jpg", ".jpeg", ".png", ".svg",
-   ".gif", ".jfif", ".webp", ".avif",
-];
+const imageExtensions = [];
 
 const videoExtensions = [
killedBy: CommonHelpers.getFileType should return "image" if the extension is .jpg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image"
Received: "file"

[Killed] StringLiteral
src/utils/CommonHelper.js:4:21
 import { DateTime } from "luxon";
 
 const imageExtensions = [
-   ".jpg", ".jpeg", ".png", ".svg",
+   ".jpg", ".jpeg", "", ".svg",
    ".gif", ".jfif", ".webp", ".avif",
 ];
killedBy: CommonHelpers.getFileType should return "image" if the extension is .png
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image"
Received: "file"

[Killed] StringLiteral
src/utils/CommonHelper.js:5:30
 
 const imageExtensions = [
    ".jpg", ".jpeg", ".png", ".svg",
-   ".gif", ".jfif", ".webp", ".avif",
+   ".gif", ".jfif", ".webp", "",
 ];
 
killedBy: CommonHelpers.getFileType should return "image" if the extension is .avif
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image"
Received: "file"

[Killed] ArrayDeclaration
src/utils/CommonHelper.js:8:25
    ".gif", ".jfif", ".webp", ".avif",
 ];
 
-const videoExtensions = [
-    ".mp4", ".avi", ".mov", ".3gp", ".wmv",
-];
+const videoExtensions = [];
 
 const audioExtensions = [
killedBy: CommonHelpers.getFileType should return "video" if the extension is .mp4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "video"
Received: "file"

[Killed] StringLiteral
src/utils/CommonHelper.js:9:5
 ];
 
 const videoExtensions = [
-    ".mp4", ".avi", ".mov", ".3gp", ".wmv",
+    "", ".avi", ".mov", ".3gp", ".wmv",
 ];
 
killedBy: CommonHelpers.getFileType should return "video" if the extension is .mp4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "video"
Received: "file"

[Killed] StringLiteral
src/utils/CommonHelper.js:18:13
 ];
 
 const documentExtensions = [
-    ".pdf", ".doc", ".docx", ".xls",
+    ".pdf", "", ".docx", ".xls",
     ".xlsx", ".ppt", ".pptx", ".odp",
     ".odt", ".ods", ".txt",
killedBy: CommonHelpers.getFileType should return "document" if the extension is .doc
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "document"
Received: "file"

[Killed] StringLiteral
src/utils/CommonHelper.js:19:22
 
 const documentExtensions = [
     ".pdf", ".doc", ".docx", ".xls",
-    ".xlsx", ".ppt", ".pptx", ".odp",
+    ".xlsx", ".ppt", "", ".odp",
     ".odt", ".ods", ".txt",
 ];
killedBy: CommonHelpers.getFileType should return "document" if the extension is .pptx
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "document"
Received: "file"

[Killed] StringLiteral
src/utils/CommonHelper.js:20:5
 const documentExtensions = [
     ".pdf", ".doc", ".docx", ".xls",
     ".xlsx", ".ppt", ".pptx", ".odp",
-    ".odt", ".ods", ".txt",
+    "", ".ods", ".txt",
 ];
 
killedBy: CommonHelpers.getFileType should return "document" if the extension is .odt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "document"
Received: "file"

[Timeout] BlockStatement
src/utils/CommonHelper.js:30:28
      * @param  {Mixed} value
      * @return {Boolean}
      */
-    static isObject(value) {
-        return value !== null && typeof value === "object" && value.constructor === Object;
-    }
+    static isObject(value) {}
 
     /**

[Killed] ConditionalExpression
src/utils/CommonHelper.js:31:16
      * @return {Boolean}
      */
     static isObject(value) {
-        return value !== null && typeof value === "object" && value.constructor === Object;
+        return true;
     }
 
killedBy: CommonHelpers.isObject should return true if the value is a(n) empty dictionary
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/CommonHelper.js:31:63
      * @return {Boolean}
      */
     static isObject(value) {
-        return value !== null && typeof value === "object" && value.constructor === Object;
+        return value !== null && typeof value === "object" && value.constructor !== Object;
     }
 
killedBy: CommonHelpers.isEmpty should return true if the value is an empty object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:40:25
      * @param  {Mixed} val
      * @return {Mixed}
      */
-    static clone(value) {
-        return typeof structuredClone !== "undefined" ? structuredClone(value) : JSON.parse(JSON.stringify(value));
-    }
+    static clone(value) {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:41:16
      * @return {Mixed}
      */
     static clone(value) {
-        return typeof structuredClone !== "undefined" ? structuredClone(value) : JSON.parse(JSON.stringify(value));
+        return false ? structuredClone(value) : JSON.parse(JSON.stringify(value));
     }
 

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:41:16
      * @return {Mixed}
      */
     static clone(value) {
-        return typeof structuredClone !== "undefined" ? structuredClone(value) : JSON.parse(JSON.stringify(value));
+        return true ? structuredClone(value) : JSON.parse(JSON.stringify(value));
     }
 

[Killed] BlockStatement
src/utils/CommonHelper.js:56:27
      * @param  {Mixed} value
      * @return {Boolean}
      */
-    static isEmpty(value) {
-        return (
-            (value === "") ||
-            (value === null) ||
-            (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
-            (value === "0001-01-01 00:00:00.000Z") || // zero datetime
-            (value === "0001-01-01") || // zero date
-            (typeof value === "undefined") ||
-            (Array.isArray(value) && value.length === 0) ||
-            (CommonHelper.isObject(value) && Object.keys(value).length === 0)
-        );
-    }
+    static isEmpty(value) {}
 
     /**
killedBy: CommonHelpers.isEmpty should return true if the value is an empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
src/utils/CommonHelper.js:58:13
      */
     static isEmpty(value) {
         return (
-            (value === "") ||
-            (value === null) ||
-            (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
-            (value === "0001-01-01 00:00:00.000Z") || // zero datetime
-            (value === "0001-01-01") || // zero date
-            (typeof value === "undefined") ||
-            (Array.isArray(value) && value.length === 0) ||
-            (CommonHelper.isObject(value) && Object.keys(value).length === 0)
+            (value === "" || value === null || value === "00000000-0000-0000-0000-000000000000" ||
+// zero uuid
+value === "0001-01-01 00:00:00.000Z" ||
+// zero datetime
+value === "0001-01-01" ||
+// zero date
+typeof value === "undefined" || Array.isArray(value) && value.length === 0) && CommonHelper.isObject(value) && Object.keys(value).length === 0
         );
     }
killedBy: CommonHelpers.isEmpty should return true if the value is an empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/utils/CommonHelper.js:58:13
      */
     static isEmpty(value) {
         return (
-            (value === "") ||
-            (value === null) ||
-            (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
+            (value === "" || value === null) && value === "00000000-0000-0000-0000-000000000000" || // zero uuid
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime
             (value === "0001-01-01") || // zero date
killedBy: CommonHelpers.isEmpty should return true if the value is an empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/utils/CommonHelper.js:59:14
     static isEmpty(value) {
         return (
             (value === "") ||
-            (value === null) ||
+            (false) ||
             (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime

[Survived] EqualityOperator
src/utils/CommonHelper.js:59:14
     static isEmpty(value) {
         return (
             (value === "") ||
-            (value === null) ||
+            (value !== null) ||
             (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime

[Survived] EqualityOperator
src/utils/CommonHelper.js:60:14
         return (
             (value === "") ||
             (value === null) ||
-            (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
+            (value !== "00000000-0000-0000-0000-000000000000") || // zero uuid
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime
             (value === "0001-01-01") || // zero date

[Survived] ConditionalExpression
src/utils/CommonHelper.js:60:14
         return (
             (value === "") ||
             (value === null) ||
-            (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
+            (false) || // zero uuid
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime
             (value === "0001-01-01") || // zero date

[Survived] ConditionalExpression
src/utils/CommonHelper.js:61:14
             (value === "") ||
             (value === null) ||
             (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
-            (value === "0001-01-01 00:00:00.000Z") || // zero datetime
+            (false) || // zero datetime
             (value === "0001-01-01") || // zero date
             (typeof value === "undefined") ||

[Survived] EqualityOperator
src/utils/CommonHelper.js:61:14
             (value === "") ||
             (value === null) ||
             (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
-            (value === "0001-01-01 00:00:00.000Z") || // zero datetime
+            (// zero uuid
+value !== "0001-01-01 00:00:00.000Z") || // zero datetime
             (value === "0001-01-01") || // zero date
             (typeof value === "undefined") ||

[Survived] ConditionalExpression
src/utils/CommonHelper.js:62:14
             (value === null) ||
             (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime
-            (value === "0001-01-01") || // zero date
+            (false) || // zero date
             (typeof value === "undefined") ||
             (Array.isArray(value) && value.length === 0) ||

[Survived] EqualityOperator
src/utils/CommonHelper.js:62:14
             (value === null) ||
             (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime
-            (value === "0001-01-01") || // zero date
+            (// zero datetime
+value !== "0001-01-01") || // zero date
             (typeof value === "undefined") ||
             (Array.isArray(value) && value.length === 0) ||

[Killed] ConditionalExpression
src/utils/CommonHelper.js:63:14
             (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime
             (value === "0001-01-01") || // zero date
-            (typeof value === "undefined") ||
+            (false) ||
             (Array.isArray(value) && value.length === 0) ||
             (CommonHelper.isObject(value) && Object.keys(value).length === 0)
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,11 +5,11 @@
        "name": "column_name",
        "sort": "",

[Killed] EqualityOperator
src/utils/CommonHelper.js:63:14
             (value === "00000000-0000-0000-0000-000000000000") || // zero uuid
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime
             (value === "0001-01-01") || // zero date
-            (typeof value === "undefined") ||
+            (// zero date
+typeof value !== "undefined") ||
             (Array.isArray(value) && value.length === 0) ||
             (CommonHelper.isObject(value) && Object.keys(value).length === 0)
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,11 +5,11 @@
        "name": "column_name",
        "sort": "",

[Killed] EqualityOperator
src/utils/CommonHelper.js:64:38
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime
             (value === "0001-01-01") || // zero date
             (typeof value === "undefined") ||
-            (Array.isArray(value) && value.length === 0) ||
+            (Array.isArray(value) && value.length !== 0) ||
             (CommonHelper.isObject(value) && Object.keys(value).length === 0)
         );
killedBy: CommonHelpers.isEmpty should return true if the value is an empty array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/CommonHelper.js:64:14
             (value === "0001-01-01 00:00:00.000Z") || // zero datetime
             (value === "0001-01-01") || // zero date
             (typeof value === "undefined") ||
-            (Array.isArray(value) && value.length === 0) ||
+            (false) ||
             (CommonHelper.isObject(value) && Object.keys(value).length === 0)
         );
killedBy: CommonHelpers.isEmpty should return true if the value is an empty array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/CommonHelper.js:65:14
             (value === "0001-01-01") || // zero date
             (typeof value === "undefined") ||
             (Array.isArray(value) && value.length === 0) ||
-            (CommonHelper.isObject(value) && Object.keys(value).length === 0)
+            (false)
         );
     }
killedBy: CommonHelpers.isEmpty should return true if the value is an empty object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/utils/CommonHelper.js:65:46
             (value === "0001-01-01") || // zero date
             (typeof value === "undefined") ||
             (Array.isArray(value) && value.length === 0) ||
-            (CommonHelper.isObject(value) && Object.keys(value).length === 0)
+            (CommonHelper.isObject(value) && Object.keys(value).length !== 0)
         );
     }
killedBy: CommonHelpers.isEmpty should return true if the value is an empty object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:75:29
      * @param  {Node} element
      * @return {Boolean}
      */
-    static isInput(element) {
-        let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
-
-        return (
-            tagName === "input" ||
-            tagName === "select" ||
-            tagName === "textarea" ||
-            element.isContentEditable
-        )
-    }
+    static isInput(element) {}
 
     /**

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:76:23
      * @return {Boolean}
      */
     static isInput(element) {
-        let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
+        let tagName = element || element.tagName ? element.tagName.toLowerCase() : "";
 
         return (

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:76:23
      * @return {Boolean}
      */
     static isInput(element) {
-        let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
+        let tagName = false ? element.tagName.toLowerCase() : "";
 
         return (

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:79:13
         let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
 
         return (
-            tagName === "input" ||
-            tagName === "select" ||
-            tagName === "textarea" ||
-            element.isContentEditable
+            false
         )
     }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:79:13
         let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
 
         return (
-            tagName === "input" ||
-            tagName === "select" ||
-            tagName === "textarea" ||
+            false ||
             element.isContentEditable
         )

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:80:13
 
         return (
             tagName === "input" ||
-            tagName === "select" ||
+            tagName !== "select" ||
             tagName === "textarea" ||
             element.isContentEditable

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:80:13
 
         return (
             tagName === "input" ||
-            tagName === "select" ||
+            false ||
             tagName === "textarea" ||
             element.isContentEditable

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:81:13
         return (
             tagName === "input" ||
             tagName === "select" ||
-            tagName === "textarea" ||
+            tagName !== "textarea" ||
             element.isContentEditable
         )

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:81:13
         return (
             tagName === "input" ||
             tagName === "select" ||
-            tagName === "textarea" ||
+            false ||
             element.isContentEditable
         )

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:92:33
      * @param  {Node} element
      * @return {Boolean}
      */
-    static isFocusable(element) {
-        let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
-
-        return (
-            CommonHelper.isInput(element) ||
-            tagName === "button" ||
-            tagName === "a" ||
-            tagName === "details" ||
-            element.tabIndex >= 0
-        );
-    }
+    static isFocusable(element) {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:93:23
      * @return {Boolean}
      */
     static isFocusable(element) {
-        let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
+        let tagName = false ? element.tagName.toLowerCase() : "";
 
         return (

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:93:23
      * @return {Boolean}
      */
     static isFocusable(element) {
-        let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
+        let tagName = element || element.tagName ? element.tagName.toLowerCase() : "";
 
         return (

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:96:13
         let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
 
         return (
-            CommonHelper.isInput(element) ||
-            tagName === "button" ||
-            tagName === "a" ||
-            tagName === "details" ||
+            (CommonHelper.isInput(element) || tagName === "button" || tagName === "a") && tagName === "details" ||
             element.tabIndex >= 0
         );

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:96:13
         let tagName = element && element.tagName ? element.tagName.toLowerCase() : "";
 
         return (
-            CommonHelper.isInput(element) ||
-            tagName === "button" ||
-            tagName === "a" ||
-            tagName === "details" ||
-            element.tabIndex >= 0
+            (CommonHelper.isInput(element) || tagName === "button" || tagName === "a" || tagName === "details") && element.tabIndex >= 0
         );
     }

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:97:13
 
         return (
             CommonHelper.isInput(element) ||
-            tagName === "button" ||
+            tagName !== "button" ||
             tagName === "a" ||
             tagName === "details" ||

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:97:13
 
         return (
             CommonHelper.isInput(element) ||
-            tagName === "button" ||
+            false ||
             tagName === "a" ||
             tagName === "details" ||

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:98:13
         return (
             CommonHelper.isInput(element) ||
             tagName === "button" ||
-            tagName === "a" ||
+            false ||
             tagName === "details" ||
             element.tabIndex >= 0

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:98:13
         return (
             CommonHelper.isInput(element) ||
             tagName === "button" ||
-            tagName === "a" ||
+            tagName !== "a" ||
             tagName === "details" ||
             element.tabIndex >= 0

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:99:13
             CommonHelper.isInput(element) ||
             tagName === "button" ||
             tagName === "a" ||
-            tagName === "details" ||
+            false ||
             element.tabIndex >= 0
         );

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:99:13
             CommonHelper.isInput(element) ||
             tagName === "button" ||
             tagName === "a" ||
-            tagName === "details" ||
+            tagName !== "details" ||
             element.tabIndex >= 0
         );

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:100:13
             tagName === "button" ||
             tagName === "a" ||
             tagName === "details" ||
-            element.tabIndex >= 0
+            element.tabIndex < 0
         );
     }

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:100:13
             tagName === "button" ||
             tagName === "a" ||
             tagName === "details" ||
-            element.tabIndex >= 0
+            element.tabIndex > 0
         );
     }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:110:34
      * @param  {Object} obj
      * @return {Boolean}
      */
-    static hasNonEmptyProps(obj) {
-        for (let i in obj) {
-            if (!CommonHelper.isEmpty(obj[i])) {
-                return true;
-            }
-        }
-
-        return false;
-    }
+    static hasNonEmptyProps(obj) {}
 
     /**

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:111:28
      * @return {Boolean}
      */
     static hasNonEmptyProps(obj) {
-        for (let i in obj) {
-            if (!CommonHelper.isEmpty(obj[i])) {
-                return true;
-            }
-        }
+        for (let i in obj) {}
 
         return false;

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:112:17
      */
     static hasNonEmptyProps(obj) {
         for (let i in obj) {
-            if (!CommonHelper.isEmpty(obj[i])) {
+            if (CommonHelper.isEmpty(obj[i])) {
                 return true;
             }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:112:17
      */
     static hasNonEmptyProps(obj) {
         for (let i in obj) {
-            if (!CommonHelper.isEmpty(obj[i])) {
+            if (true) {
                 return true;
             }

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:113:24
     static hasNonEmptyProps(obj) {
         for (let i in obj) {
             if (!CommonHelper.isEmpty(obj[i])) {
-                return true;
+                return false;
             }
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:127:45
      * @param  {Boolean} [allowEmpty]
      * @return {Array}
      */
-    static toArray(arr, allowEmpty = false) {
-        if (Array.isArray(arr)) {
-            return arr.slice();
-        }
-
-        return (allowEmpty || !CommonHelper.isEmpty(arr)) && typeof arr !== "undefined" ? [arr] : [];
-    }
+    static toArray(arr, allowEmpty = false) {}
 
     /**

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:127:38
      * @param  {Boolean} [allowEmpty]
      * @return {Array}
      */
-    static toArray(arr, allowEmpty = false) {
+    static toArray(arr, allowEmpty = true) {
         if (Array.isArray(arr)) {
             return arr.slice();

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:128:33
      * @return {Array}
      */
     static toArray(arr, allowEmpty = false) {
-        if (Array.isArray(arr)) {
-            return arr.slice();
-        }
+        if (Array.isArray(arr)) {}
 
         return (allowEmpty || !CommonHelper.isEmpty(arr)) && typeof arr !== "undefined" ? [arr] : [];

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:128:13
      * @return {Array}
      */
     static toArray(arr, allowEmpty = false) {
-        if (Array.isArray(arr)) {
+        if (false) {
             return arr.slice();
         }

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:129:20
      */
     static toArray(arr, allowEmpty = false) {
         if (Array.isArray(arr)) {
-            return arr.slice();
+            return arr;
         }
 

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:132:16
             return arr.slice();
         }
 
-        return (allowEmpty || !CommonHelper.isEmpty(arr)) && typeof arr !== "undefined" ? [arr] : [];
+        return allowEmpty || !CommonHelper.isEmpty(arr) || typeof arr !== "undefined" ? [arr] : [];
     }
 

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:132:16
             return arr.slice();
         }
 
-        return (allowEmpty || !CommonHelper.isEmpty(arr)) && typeof arr !== "undefined" ? [arr] : [];
+        return true ? [arr] : [];
     }
 

[Killed] BlockStatement
src/utils/CommonHelper.js:142:32
      * @param  {String} value
      * @return {Boolean}
      */
-    static inArray(arr, value) {
-        arr = Array.isArray(arr) ? arr : [];
-
-        for (let i = arr.length - 1; i >= 0; i--) {
-            if (arr[i] == value) {
-                return true;
-            }
-        }
-
-        return false;
-    }
+    static inArray(arr, value) {}
 
     /**
killedBy: CommonHelpers.pushUnique should not push the item to the array if it is already in it
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    1,
    2,

[Survived] ArrayDeclaration
src/utils/CommonHelper.js:143:42
      * @return {Boolean}
      */
     static inArray(arr, value) {
-        arr = Array.isArray(arr) ? arr : [];
+        arr = Array.isArray(arr) ? arr : ["Stryker was here"];
 
         for (let i = arr.length - 1; i >= 0; i--) {

[Killed] ConditionalExpression
src/utils/CommonHelper.js:145:38
     static inArray(arr, value) {
         arr = Array.isArray(arr) ? arr : [];
 
-        for (let i = arr.length - 1; i >= 0; i--) {
+        for (let i = arr.length - 1; false; i--) {
             if (arr[i] == value) {
                 return true;
killedBy: CommonHelpers.pushUnique should not push the item to the array if it is already in it
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    1,
    2,

[Killed] BlockStatement
src/utils/CommonHelper.js:145:51
     static inArray(arr, value) {
         arr = Array.isArray(arr) ? arr : [];
 
-        for (let i = arr.length - 1; i >= 0; i--) {
-            if (arr[i] == value) {
-                return true;
-            }
-        }
+        for (let i = arr.length - 1; i >= 0; i--) {}
 
         return false;
killedBy: CommonHelpers.pushUnique should not push the item to the array if it is already in it
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    1,
    2,

[Killed] ConditionalExpression
src/utils/CommonHelper.js:146:17
         arr = Array.isArray(arr) ? arr : [];
 
         for (let i = arr.length - 1; i >= 0; i--) {
-            if (arr[i] == value) {
+            if (true) {
                 return true;
             }
killedBy: CommonHelpers.pushUnique should push the item to the array if it is not already in it
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    1,
    2,

[Killed] EqualityOperator
src/utils/CommonHelper.js:146:17
         arr = Array.isArray(arr) ? arr : [];
 
         for (let i = arr.length - 1; i >= 0; i--) {
-            if (arr[i] == value) {
+            if (arr[i] != value) {
                 return true;
             }
killedBy: CommonHelpers.pushUnique should push the item to the array if it is not already in it
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    1,
    2,
