[Killed] BooleanLiteral
src/utils/CommonHelper.js:147:24
 
         for (let i = arr.length - 1; i >= 0; i--) {
             if (arr[i] == value) {
-                return true;
+                return false;
             }
         }
killedBy: CommonHelpers.pushUnique should not push the item to the array if it is already in it
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    1,
    2,

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:160:38
      * @param {Array} arr
      * @param {Mixed} value
      */
-    static removeByValue(arr, value) {
-        arr = Array.isArray(arr) ? arr : [];
-
-        for (let i = arr.length - 1; i >= 0; i--) {
-            if (arr[i] == value) {
-                arr.splice(i, 1);
-                break;
-            }
-        }
-    }
+    static removeByValue(arr, value) {}
 
     /**

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:163:38
     static removeByValue(arr, value) {
         arr = Array.isArray(arr) ? arr : [];
 
-        for (let i = arr.length - 1; i >= 0; i--) {
+        for (let i = arr.length - 1; i > 0; i--) {
             if (arr[i] == value) {
                 arr.splice(i, 1);

[NoCoverage] UpdateOperator
src/utils/CommonHelper.js:163:46
     static removeByValue(arr, value) {
         arr = Array.isArray(arr) ? arr : [];
 
-        for (let i = arr.length - 1; i >= 0; i--) {
+        for (let i = arr.length - 1; i >= 0; i++) {
             if (arr[i] == value) {
                 arr.splice(i, 1);

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:164:34
         arr = Array.isArray(arr) ? arr : [];
 
         for (let i = arr.length - 1; i >= 0; i--) {
-            if (arr[i] == value) {
-                arr.splice(i, 1);
-                break;
-            }
+            if (arr[i] == value) {}
         }
     }

[Killed] BlockStatement
src/utils/CommonHelper.js:177:35
      * @param {Array} arr
      * @param {Mixed} value
      */
-    static pushUnique(arr, value) {
-        if (!CommonHelper.inArray(arr, value)) {
-            arr.push(value);
-        }
-    }
+    static pushUnique(arr, value) {}
 
     /**
killedBy: CommonHelpers.pushUnique should push the item to the array if it is not already in it
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    1,
    2,

[Killed] BlockStatement
src/utils/CommonHelper.js:178:48
      * @param {Mixed} value
      */
     static pushUnique(arr, value) {
-        if (!CommonHelper.inArray(arr, value)) {
-            arr.push(value);
-        }
+        if (!CommonHelper.inArray(arr, value)) {}
     }
 
killedBy: CommonHelpers.pushUnique should push the item to the array if it is not already in it
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    1,
    2,

[Killed] BooleanLiteral
src/utils/CommonHelper.js:178:13
      * @param {Mixed} value
      */
     static pushUnique(arr, value) {
-        if (!CommonHelper.inArray(arr, value)) {
+        if (CommonHelper.inArray(arr, value)) {
             arr.push(value);
         }
killedBy: CommonHelpers.pushUnique should push the item to the array if it is not already in it
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    1,
    2,

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:191:46
      * @param  {Mixed} value
      * @return {Object}
      */
-    static findByKey(objectsArr, key, value) {
-        objectsArr = Array.isArray(objectsArr) ? objectsArr : [];
-
-        for (let i in objectsArr) {
-            if (objectsArr[i][key] == value) {
-                return objectsArr[i];
-            }
-        }
-
-        return null;
-    }
+    static findByKey(objectsArr, key, value) {}
 
     /**

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:194:35
     static findByKey(objectsArr, key, value) {
         objectsArr = Array.isArray(objectsArr) ? objectsArr : [];
 
-        for (let i in objectsArr) {
-            if (objectsArr[i][key] == value) {
-                return objectsArr[i];
-            }
-        }
+        for (let i in objectsArr) {}
 
         return null;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:195:17
         objectsArr = Array.isArray(objectsArr) ? objectsArr : [];
 
         for (let i in objectsArr) {
-            if (objectsArr[i][key] == value) {
+            if (true) {
                 return objectsArr[i];
             }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:195:17
         objectsArr = Array.isArray(objectsArr) ? objectsArr : [];
 
         for (let i in objectsArr) {
-            if (objectsArr[i][key] == value) {
+            if (false) {
                 return objectsArr[i];
             }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:210:40
      * @param  {String} key
      * @return {Object}
      */
-    static groupByKey(objectsArr, key) {
-        objectsArr = Array.isArray(objectsArr) ? objectsArr : [];
-
-        const result = {};
-
-        for (let i in objectsArr) {
-            result[objectsArr[i][key]] = result[objectsArr[i][key]] || [];
-
-            result[objectsArr[i][key]].push(objectsArr[i]);
-        }
-
-        return result;
-    }
+    static groupByKey(objectsArr, key) {}
 
     /**

[NoCoverage] ArrayDeclaration
src/utils/CommonHelper.js:211:63
      * @return {Object}
      */
     static groupByKey(objectsArr, key) {
-        objectsArr = Array.isArray(objectsArr) ? objectsArr : [];
+        objectsArr = Array.isArray(objectsArr) ? objectsArr : ["Stryker was here"];
 
         const result = {};

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:215:35
 
         const result = {};
 
-        for (let i in objectsArr) {
-            result[objectsArr[i][key]] = result[objectsArr[i][key]] || [];
-
-            result[objectsArr[i][key]].push(objectsArr[i]);
-        }
+        for (let i in objectsArr) {}
 
         return result;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:216:42
         const result = {};
 
         for (let i in objectsArr) {
-            result[objectsArr[i][key]] = result[objectsArr[i][key]] || [];
+            result[objectsArr[i][key]] = false;
 
             result[objectsArr[i][key]].push(objectsArr[i]);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:216:42
         const result = {};
 
         for (let i in objectsArr) {
-            result[objectsArr[i][key]] = result[objectsArr[i][key]] || [];
+            result[objectsArr[i][key]] = true;
 
             result[objectsArr[i][key]].push(objectsArr[i]);

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:231:48
      * @param {String} key
      * @param {Mixed}  value
      */
-    static removeByKey(objectsArr, key, value) {
-        for (let i in objectsArr) {
-            if (objectsArr[i][key] == value) {
-                objectsArr.splice(i, 1);
-                break;
-            }
-        }
-    }
+    static removeByKey(objectsArr, key, value) {}
 
     /**

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:232:35
      * @param {Mixed}  value
      */
     static removeByKey(objectsArr, key, value) {
-        for (let i in objectsArr) {
-            if (objectsArr[i][key] == value) {
-                objectsArr.splice(i, 1);
-                break;
-            }
-        }
+        for (let i in objectsArr) {}
     }
 

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:233:17
      */
     static removeByKey(objectsArr, key, value) {
         for (let i in objectsArr) {
-            if (objectsArr[i][key] == value) {
+            if (objectsArr[i][key] != value) {
                 objectsArr.splice(i, 1);
                 break;

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:247:61
      * @param {Object} item
      * @param {Mixed}  [key]
      */
-    static pushOrReplaceByKey(objectsArr, item, key = "id") {
-        for (let i = objectsArr.length - 1; i >= 0; i--) {
-            if (objectsArr[i][key] == item[key]) {
-                objectsArr[i] = item; // replace
-                return;
-            }
-        }
-
-        objectsArr.push(item);
-    }
+    static pushOrReplaceByKey(objectsArr, item, key = "id") {}
 
     /**

[NoCoverage] ArithmeticOperator
src/utils/CommonHelper.js:248:22
      * @param {Mixed}  [key]
      */
     static pushOrReplaceByKey(objectsArr, item, key = "id") {
-        for (let i = objectsArr.length - 1; i >= 0; i--) {
+        for (let i = objectsArr.length + 1; i >= 0; i--) {
             if (objectsArr[i][key] == item[key]) {
                 objectsArr[i] = item; // replace

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:248:45
      * @param {Mixed}  [key]
      */
     static pushOrReplaceByKey(objectsArr, item, key = "id") {
-        for (let i = objectsArr.length - 1; i >= 0; i--) {
+        for (let i = objectsArr.length - 1; i > 0; i--) {
             if (objectsArr[i][key] == item[key]) {
                 objectsArr[i] = item; // replace

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:249:17
      */
     static pushOrReplaceByKey(objectsArr, item, key = "id") {
         for (let i = objectsArr.length - 1; i >= 0; i--) {
-            if (objectsArr[i][key] == item[key]) {
+            if (objectsArr[i][key] != item[key]) {
                 objectsArr[i] = item; // replace
                 return;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:249:17
      */
     static pushOrReplaceByKey(objectsArr, item, key = "id") {
         for (let i = objectsArr.length - 1; i >= 0; i--) {
-            if (objectsArr[i][key] == item[key]) {
+            if (true) {
                 objectsArr[i] = item; // replace
                 return;

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:265:58
      * @param  {String} key
      * @return {Array}
      */
-    static filterDuplicatesByKey(objectsArr, key = "id") {
-        objectsArr = Array.isArray(objectsArr) ? objectsArr : [];
-
-        const uniqueMap = {};
-
-        for (const item of objectsArr) {
-            uniqueMap[item[key]] = item;
-        }
-
-        return Object.values(uniqueMap)
-    }
+    static filterDuplicatesByKey(objectsArr, key = "id") {}
 
     /**

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:270:40
 
         const uniqueMap = {};
 
-        for (const item of objectsArr) {
-            uniqueMap[item[key]] = item;
-        }
+        for (const item of objectsArr) {}
 
         return Object.values(uniqueMap)

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:284:54
      * @param  {String} [mask] Default to '******'
      * @return {Object}
      */
-    static filterRedactedProps(obj, mask = "******") {
-        const result = JSON.parse(JSON.stringify(obj || {}));
-
-        for (let prop in result) {
-            if (typeof result[prop] === 'object' && result[prop] !== null) {
-                result[prop] = CommonHelper.filterRedactedProps(result[prop], mask)
-            } else if (result[prop] === mask) {
-                delete result[prop];
-            }
-        }
-        return result;
-    }
+    static filterRedactedProps(obj, mask = "******") {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:285:50
      * @return {Object}
      */
     static filterRedactedProps(obj, mask = "******") {
-        const result = JSON.parse(JSON.stringify(obj || {}));
+        const result = JSON.parse(JSON.stringify(false));
 
         for (let prop in result) {

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:285:50
      * @return {Object}
      */
     static filterRedactedProps(obj, mask = "******") {
-        const result = JSON.parse(JSON.stringify(obj || {}));
+        const result = JSON.parse(JSON.stringify(obj && {}));
 
         for (let prop in result) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:287:34
     static filterRedactedProps(obj, mask = "******") {
         const result = JSON.parse(JSON.stringify(obj || {}));
 
-        for (let prop in result) {
-            if (typeof result[prop] === 'object' && result[prop] !== null) {
-                result[prop] = CommonHelper.filterRedactedProps(result[prop], mask)
-            } else if (result[prop] === mask) {
-                delete result[prop];
-            }
-        }
+        for (let prop in result) {}
         return result;
     }

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:288:17
         const result = JSON.parse(JSON.stringify(obj || {}));
 
         for (let prop in result) {
-            if (typeof result[prop] === 'object' && result[prop] !== null) {
+            if (typeof result[prop] !== 'object' && result[prop] !== null) {
                 result[prop] = CommonHelper.filterRedactedProps(result[prop], mask)
             } else if (result[prop] === mask) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:288:53
         const result = JSON.parse(JSON.stringify(obj || {}));
 
         for (let prop in result) {
-            if (typeof result[prop] === 'object' && result[prop] !== null) {
+            if (typeof result[prop] === 'object' && true) {
                 result[prop] = CommonHelper.filterRedactedProps(result[prop], mask)
             } else if (result[prop] === mask) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:290:24
         for (let prop in result) {
             if (typeof result[prop] === 'object' && result[prop] !== null) {
                 result[prop] = CommonHelper.filterRedactedProps(result[prop], mask)
-            } else if (result[prop] === mask) {
+            } else if (false) {
                 delete result[prop];
             }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:290:47
         for (let prop in result) {
             if (typeof result[prop] === 'object' && result[prop] !== null) {
                 result[prop] = CommonHelper.filterRedactedProps(result[prop], mask)
-            } else if (result[prop] === mask) {
-                delete result[prop];
-            }
+            } else if (result[prop] === mask) {}
         }
         return result;

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:314:73
      * @param  {String}       [delimiter]
      * @return {Mixed}
      */
-    static getNestedVal(data, path, defaultVal = null, delimiter = ".") {
-        let result = data || {};
-        let parts  = (path || '').split(delimiter);
-
-        for (const part of parts) {
-            if (
-                (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                typeof result[part] === "undefined"
-            ) {
-                return defaultVal;
-            }
-
-            result = result[part];
-        }
-
-        return result;
-    }
+    static getNestedVal(data, path, defaultVal = null, delimiter = ".") {}
 
     /**

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:315:22
      * @return {Mixed}
      */
     static getNestedVal(data, path, defaultVal = null, delimiter = ".") {
-        let result = data || {};
+        let result = data && {};
         let parts  = (path || '').split(delimiter);
 

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:315:22
      * @return {Mixed}
      */
     static getNestedVal(data, path, defaultVal = null, delimiter = ".") {
-        let result = data || {};
+        let result = true;
         let parts  = (path || '').split(delimiter);
 

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:316:23
      */
     static getNestedVal(data, path, defaultVal = null, delimiter = ".") {
         let result = data || {};
-        let parts  = (path || '').split(delimiter);
+        let parts  = (path && '').split(delimiter);
 
         for (const part of parts) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:316:23
      */
     static getNestedVal(data, path, defaultVal = null, delimiter = ".") {
         let result = data || {};
-        let parts  = (path || '').split(delimiter);
+        let parts  = (true).split(delimiter);
 
         for (const part of parts) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:318:35
         let result = data || {};
         let parts  = (path || '').split(delimiter);
 
-        for (const part of parts) {
-            if (
-                (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                typeof result[part] === "undefined"
-            ) {
-                return defaultVal;
-            }
-
-            result = result[part];
-        }
+        for (const part of parts) {}
 
         return result;

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:320:18
 
         for (const part of parts) {
             if (
-                (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
+                (CommonHelper.isObject(result) && !Array.isArray(result)) ||
                 typeof result[part] === "undefined"
             ) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:320:17
 
         for (const part of parts) {
             if (
-                (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                typeof result[part] === "undefined"
+                true
             ) {
                 return defaultVal;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:321:17
         for (const part of parts) {
             if (
                 (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                typeof result[part] === "undefined"
+                false
             ) {
                 return defaultVal;

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:321:17
         for (const part of parts) {
             if (
                 (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                typeof result[part] === "undefined"
+                typeof result[part] !== "undefined"
             ) {
                 return defaultVal;

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:322:15
             if (
                 (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
                 typeof result[part] === "undefined"
-            ) {
-                return defaultVal;
-            }
+            ) {}
 
             result = result[part];

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:345:61
      * @param  {string}       path
      * @param  {String}       delimiter
      */
-    static setByPath(data, path, newValue, delimiter = ".") {
-        if (data === null || typeof data !== 'object') {
-            console.warn("setByPath: data not an object or array.");
-            return
-        }
-
-        let result   = data;
-        let parts    = path.split(delimiter);
-        let lastPart = parts.pop();
-
-        for (const part of parts) {
-            if (
-                (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                (!CommonHelper.isObject(result[part]) && !Array.isArray(result[part]))
-            ) {
-                result[part] = {};
-            }
-
-            result = result[part];
-        }
-
-        result[lastPart] = newValue;
-    }
+    static setByPath(data, path, newValue, delimiter = ".") {}
 
     /**

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:346:30
      * @param  {String}       delimiter
      */
     static setByPath(data, path, newValue, delimiter = ".") {
-        if (data === null || typeof data !== 'object') {
+        if (data === null || typeof data === 'object') {
             console.warn("setByPath: data not an object or array.");
             return

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:346:13
      * @param  {String}       delimiter
      */
     static setByPath(data, path, newValue, delimiter = ".") {
-        if (data === null || typeof data !== 'object') {
+        if (false) {
             console.warn("setByPath: data not an object or array.");
             return

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:355:35
         let parts    = path.split(delimiter);
         let lastPart = parts.pop();
 
-        for (const part of parts) {
-            if (
-                (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                (!CommonHelper.isObject(result[part]) && !Array.isArray(result[part]))
-            ) {
-                result[part] = {};
-            }
-
-            result = result[part];
-        }
+        for (const part of parts) {}
 
         result[lastPart] = newValue;

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:357:52
 
         for (const part of parts) {
             if (
-                (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
+                (!CommonHelper.isObject(result) && Array.isArray(result)) ||
                 (!CommonHelper.isObject(result[part]) && !Array.isArray(result[part]))
             ) {

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:357:18
 
         for (const part of parts) {
             if (
-                (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
+                (!CommonHelper.isObject(result) || !Array.isArray(result)) ||
                 (!CommonHelper.isObject(result[part]) && !Array.isArray(result[part]))
             ) {

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:358:58
         for (const part of parts) {
             if (
                 (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                (!CommonHelper.isObject(result[part]) && !Array.isArray(result[part]))
+                (!CommonHelper.isObject(result[part]) && Array.isArray(result[part]))
             ) {
                 result[part] = {};

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:358:18
         for (const part of parts) {
             if (
                 (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                (!CommonHelper.isObject(result[part]) && !Array.isArray(result[part]))
+                (CommonHelper.isObject(result[part]) && !Array.isArray(result[part]))
             ) {
                 result[part] = {};

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:359:15
             if (
                 (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
                 (!CommonHelper.isObject(result[part]) && !Array.isArray(result[part]))
-            ) {
-                result[part] = {};
-            }
+            ) {}
 
             result = result[part];

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:384:24
      * @param  {String}       delimiter
      */
     static deleteByPath(data, path, delimiter = ".") {
-        let result   = data || {};
+        let result   = false;
         let parts    = (path || '').split(delimiter);
         let lastPart = parts.pop();

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:384:24
      * @param  {String}       delimiter
      */
     static deleteByPath(data, path, delimiter = ".") {
-        let result   = data || {};
+        let result   = true;
         let parts    = (path || '').split(delimiter);
         let lastPart = parts.pop();

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:385:25
      */
     static deleteByPath(data, path, delimiter = ".") {
         let result   = data || {};
-        let parts    = (path || '').split(delimiter);
+        let parts    = (false).split(delimiter);
         let lastPart = parts.pop();
 

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:391:18
         for (const part of parts) {
             if (
                 (!CommonHelper.isObject(result) && !Array.isArray(result)) ||
-                (!CommonHelper.isObject(result[part]) && !Array.isArray(result[part]))
+                (!CommonHelper.isObject(result[part]) || !Array.isArray(result[part]))
             ) {
                 result[part] = {};

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:399:36
             result = result[part];
         }
 
-        if (Array.isArray(result)) {
-            result.splice(lastPart, 1);
-        } else if (CommonHelper.isObject(result)) {
+        if (Array.isArray(result)) {} else if (CommonHelper.isObject(result)) {
             delete (result[lastPart]);
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:399:13
             result = result[part];
         }
 
-        if (Array.isArray(result)) {
+        if (false) {
             result.splice(lastPart, 1);
         } else if (CommonHelper.isObject(result)) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:401:51
 
         if (Array.isArray(result)) {
             result.splice(lastPart, 1);
-        } else if (CommonHelper.isObject(result)) {
-            delete (result[lastPart]);
-        }
+        } else if (CommonHelper.isObject(result)) {}
 
         // cleanup the parents chain

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:401:20
 
         if (Array.isArray(result)) {
             result.splice(lastPart, 1);
-        } else if (CommonHelper.isObject(result)) {
+        } else if (true) {
             delete (result[lastPart]);
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:407:13
 
         // cleanup the parents chain
         if (
-            parts.length > 0 &&
-            (
-                (Array.isArray(result) && !result.length) ||
-                (CommonHelper.isObject(result) && !Object.keys(result).length)
-            ) &&
-            (
-                (Array.isArray(data) && data.length > 0) ||
-                (CommonHelper.isObject(data) && Object.keys(data).length > 0)
-            )
+            false
         ) {
             CommonHelper.deleteByPath(data, parts.join(delimiter), delimiter);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:407:13
 
         // cleanup the parents chain
         if (
-            parts.length > 0 &&
-            (
-                (Array.isArray(result) && !result.length) ||
-                (CommonHelper.isObject(result) && !Object.keys(result).length)
-            ) &&
-            (
-                (Array.isArray(data) && data.length > 0) ||
-                (CommonHelper.isObject(data) && Object.keys(data).length > 0)
-            )
+            true
         ) {
             CommonHelper.deleteByPath(data, parts.join(delimiter), delimiter);

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:409:43
         if (
             parts.length > 0 &&
             (
-                (Array.isArray(result) && !result.length) ||
+                (Array.isArray(result) && result.length) ||
                 (CommonHelper.isObject(result) && !Object.keys(result).length)
             ) &&

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:409:18
         if (
             parts.length > 0 &&
             (
-                (Array.isArray(result) && !result.length) ||
+                (false) ||
                 (CommonHelper.isObject(result) && !Object.keys(result).length)
             ) &&

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:410:51
             parts.length > 0 &&
             (
                 (Array.isArray(result) && !result.length) ||
-                (CommonHelper.isObject(result) && !Object.keys(result).length)
+                (CommonHelper.isObject(result) && Object.keys(result).length)
             ) &&
             (

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:410:18
             parts.length > 0 &&
             (
                 (Array.isArray(result) && !result.length) ||
-                (CommonHelper.isObject(result) && !Object.keys(result).length)
+                (false)
             ) &&
             (

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:413:18
                 (CommonHelper.isObject(result) && !Object.keys(result).length)
             ) &&
             (
-                (Array.isArray(data) && data.length > 0) ||
+                (Array.isArray(data) || data.length > 0) ||
                 (CommonHelper.isObject(data) && Object.keys(data).length > 0)
             )

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:413:41
                 (CommonHelper.isObject(result) && !Object.keys(result).length)
             ) &&
             (
-                (Array.isArray(data) && data.length > 0) ||
+                (Array.isArray(data) && data.length <= 0) ||
                 (CommonHelper.isObject(data) && Object.keys(data).length > 0)
             )

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:414:49
             ) &&
             (
                 (Array.isArray(data) && data.length > 0) ||
-                (CommonHelper.isObject(data) && Object.keys(data).length > 0)
+                (CommonHelper.isObject(data) && Object.keys(data).length >= 0)
             )
         ) {

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:414:18
             ) &&
             (
                 (Array.isArray(data) && data.length > 0) ||
-                (CommonHelper.isObject(data) && Object.keys(data).length > 0)
+                (CommonHelper.isObject(data) || Object.keys(data).length > 0)
             )
         ) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:416:11
                 (Array.isArray(data) && data.length > 0) ||
                 (CommonHelper.isObject(data) && Object.keys(data).length > 0)
             )
-        ) {
-            CommonHelper.deleteByPath(data, parts.join(delimiter), delimiter);
-        }
+        ) {}
     }
 
