[Killed] BlockStatement
src/utils/CommonHelper.js:427:33
      * @param  {Number} [length] Results string length (default 10)
      * @return {String}
      */
-    static randomString(length) {
-        length = length || 10;
-
-        let result = "";
-        let alphabet = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789";
-
-        for (let i = 0; i < length; i++) {
-            result += alphabet.charAt(Math.floor(Math.random() * alphabet.length));
-        }
-
-        return result;
-    }
+    static randomString(length) {}
 
     /**
killedBy: CommonHelpers.randomString should return a random string
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not undefined

[Killed] ConditionalExpression
src/utils/CommonHelper.js:428:18
      * @return {String}
      */
     static randomString(length) {
-        length = length || 10;
+        length = false;
 
         let result = "";
killedBy: CommonHelpers.randomString should return a random string
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not ""

[Killed] ConditionalExpression
src/utils/CommonHelper.js:428:18
      * @return {String}
      */
     static randomString(length) {
-        length = length || 10;
+        length = true;
 
         let result = "";
killedBy: CommonHelpers.randomString should return a string with the correct length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 1

[Killed] ConditionalExpression
src/utils/CommonHelper.js:433:25
         let result = "";
         let alphabet = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789";
 
-        for (let i = 0; i < length; i++) {
+        for (let i = 0; false; i++) {
             result += alphabet.charAt(Math.floor(Math.random() * alphabet.length));
         }
killedBy: CommonHelpers.randomString should return a random string
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not ""

[Killed] AssignmentOperator
src/utils/CommonHelper.js:434:13
         let alphabet = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789";
 
         for (let i = 0; i < length; i++) {
-            result += alphabet.charAt(Math.floor(Math.random() * alphabet.length));
+            result -= alphabet.charAt(Math.floor(Math.random() * alphabet.length));
         }
 
killedBy: CommonHelpers.randomString should return a random string
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not NaN

[Killed] MethodExpression
src/utils/CommonHelper.js:434:23
         let alphabet = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789";
 
         for (let i = 0; i < length; i++) {
-            result += alphabet.charAt(Math.floor(Math.random() * alphabet.length));
+            result += alphabet;
         }
 
killedBy: CommonHelpers.randomString should return a random string
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:447:45
      * @param  {Boolean} [stopCheck]
      * @return {String}
      */
-    static sentenize(str, stopCheck = true) {
-        if (typeof str !== "string") {
-            return "";
-        }
-
-        str = str.trim().split("_").join(" ");
-        if (str === "") {
-            return str;
-        }
-
-        str = str[0].toUpperCase() + str.substring(1);
-
-        if (stopCheck) {
-            let lastChar = str[str.length - 1];
-            if (lastChar !== "." && lastChar !== "?" && lastChar !== "!") {
-                str += ".";
-            }
-        }
-
-        return str
-    }
+    static sentenize(str, stopCheck = true) {}
 
     /**

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:447:39
      * @param  {Boolean} [stopCheck]
      * @return {String}
      */
-    static sentenize(str, stopCheck = true) {
+    static sentenize(str, stopCheck = false) {
         if (typeof str !== "string") {
             return "";

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:448:13
      * @return {String}
      */
     static sentenize(str, stopCheck = true) {
-        if (typeof str !== "string") {
+        if (typeof str === "string") {
             return "";
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:448:13
      * @return {String}
      */
     static sentenize(str, stopCheck = true) {
-        if (typeof str !== "string") {
+        if (true) {
             return "";
         }

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:452:15
             return "";
         }
 
-        str = str.trim().split("_").join(" ");
+        str = str.split("_").join(" ");
         if (str === "") {
             return str;

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:452:32
             return "";
         }
 
-        str = str.trim().split("_").join(" ");
+        str = str.trim().split("").join(" ");
         if (str === "") {
             return str;

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:453:13
         }
 
         str = str.trim().split("_").join(" ");
-        if (str === "") {
+        if (str !== "") {
             return str;
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:453:13
         }
 
         str = str.trim().split("_").join(" ");
-        if (str === "") {
+        if (true) {
             return str;
         }

[NoCoverage] ArithmeticOperator
src/utils/CommonHelper.js:457:15
             return str;
         }
 
-        str = str[0].toUpperCase() + str.substring(1);
+        str = str[0].toUpperCase() - str.substring(1);
 
         if (stopCheck) {

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:457:38
             return str;
         }
 
-        str = str[0].toUpperCase() + str.substring(1);
+        str = str[0].toUpperCase() + str;
 
         if (stopCheck) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:459:24
 
         str = str[0].toUpperCase() + str.substring(1);
 
-        if (stopCheck) {
-            let lastChar = str[str.length - 1];
-            if (lastChar !== "." && lastChar !== "?" && lastChar !== "!") {
-                str += ".";
-            }
-        }
+        if (stopCheck) {}
 
         return str

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:459:13
 
         str = str[0].toUpperCase() + str.substring(1);
 
-        if (stopCheck) {
+        if (false) {
             let lastChar = str[str.length - 1];
             if (lastChar !== "." && lastChar !== "?" && lastChar !== "!") {

[NoCoverage] ArithmeticOperator
src/utils/CommonHelper.js:460:32
         str = str[0].toUpperCase() + str.substring(1);
 
         if (stopCheck) {
-            let lastChar = str[str.length - 1];
+            let lastChar = str[str.length + 1];
             if (lastChar !== "." && lastChar !== "?" && lastChar !== "!") {
                 str += ".";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:461:17
 
         if (stopCheck) {
             let lastChar = str[str.length - 1];
-            if (lastChar !== "." && lastChar !== "?" && lastChar !== "!") {
+            if (true) {
                 str += ".";
             }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:461:17
 
         if (stopCheck) {
             let lastChar = str[str.length - 1];
-            if (lastChar !== "." && lastChar !== "?" && lastChar !== "!") {
+            if (true && lastChar !== "!") {
                 str += ".";
             }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:478:33
      * @param  {Mixed} val
      * @return {Mixed}
      */
-    static trimQuotedValue(val) {
-        if (
-            typeof val == "string" &&
-            (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
-            val[0] == val[val.length-1]
-        ) {
-            return val.slice(1, -1);
-        }
-
-        return val
-    }
+    static trimQuotedValue(val) {}
 
     /**

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:480:13
      */
     static trimQuotedValue(val) {
         if (
-            typeof val == "string" &&
-            (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
-            val[0] == val[val.length-1]
+            typeof val == "string" && (val[0] == `"` || val[0] == `'` || val[0] == "`") || val[0] == val[val.length - 1]
         ) {
             return val.slice(1, -1);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:480:13
      */
     static trimQuotedValue(val) {
         if (
-            typeof val == "string" &&
-            (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
-            val[0] == val[val.length-1]
+            true
         ) {
             return val.slice(1, -1);

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:481:49
     static trimQuotedValue(val) {
         if (
             typeof val == "string" &&
-            (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
+            (val[0] == `"`  || val[0] == `'` || val[0] != "`") &&
             val[0] == val[val.length-1]
         ) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:481:14
     static trimQuotedValue(val) {
         if (
             typeof val == "string" &&
-            (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
+            (true) &&
             val[0] == val[val.length-1]
         ) {

[NoCoverage] ArithmeticOperator
src/utils/CommonHelper.js:482:27
         if (
             typeof val == "string" &&
             (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
-            val[0] == val[val.length-1]
+            val[0] == val[val.length + 1]
         ) {
             return val.slice(1, -1);

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:482:13
         if (
             typeof val == "string" &&
             (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
-            val[0] == val[val.length-1]
+            val[0] != val[val.length - 1]
         ) {
             return val.slice(1, -1);

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:483:11
             typeof val == "string" &&
             (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
             val[0] == val[val.length-1]
-        ) {
-            return val.slice(1, -1);
-        }
+        ) {}
 
         return val

[NoCoverage] UnaryOperator
src/utils/CommonHelper.js:484:33
             (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
             val[0] == val[val.length-1]
         ) {
-            return val.slice(1, -1);
+            return val.slice(1, +1);
         }
 

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:484:20
             (val[0] == `"`  || val[0] == `'` || val[0] == "`") &&
             val[0] == val[val.length-1]
         ) {
-            return val.slice(1, -1);
+            return val;
         }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:496:27
      * @param  {String} str
      * @return {String}
      */
-    static plainText(str) {
-        if (!str) {
-            return "";
-        }
-
-        const doc = new DOMParser().parseFromString(str, "text/html");
-
-        return (doc.body.innerText || "").trim();
-    }
+    static plainText(str) {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:497:13
      * @return {String}
      */
     static plainText(str) {
-        if (!str) {
+        if (true) {
             return "";
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:497:19
      * @return {String}
      */
     static plainText(str) {
-        if (!str) {
-            return "";
-        }
+        if (!str) {}
 
         const doc = new DOMParser().parseFromString(str, "text/html");

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:503:16
 
         const doc = new DOMParser().parseFromString(str, "text/html");
 
-        return (doc.body.innerText || "").trim();
+        return doc.body.innerText || "";
     }
 

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:503:17
 
         const doc = new DOMParser().parseFromString(str, "text/html");
 
-        return (doc.body.innerText || "").trim();
+        return (doc.body.innerText && "").trim();
     }
 

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:514:47
      * @param  {Boolean} [dots]
      * @return {String}
      */
-    static truncate(str, length = 150, dots = true) {
+    static truncate(str, length = 150, dots = false) {
         str = str || "";
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:514:53
      * @param  {Boolean} [dots]
      * @return {String}
      */
-    static truncate(str, length = 150, dots = true) {
-        str = str || "";
-
-        if (str.length <= length) {
-            return str;
-        }
-
-        return str.substring(0, length) + (dots ? "..." : "");
-    }
+    static truncate(str, length = 150, dots = true) {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:515:15
      * @return {String}
      */
     static truncate(str, length = 150, dots = true) {
-        str = str || "";
+        str = false;
 
         if (str.length <= length) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:515:15
      * @return {String}
      */
     static truncate(str, length = 150, dots = true) {
-        str = str || "";
+        str = true;
 
         if (str.length <= length) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:517:35
     static truncate(str, length = 150, dots = true) {
         str = str || "";
 
-        if (str.length <= length) {
-            return str;
-        }
+        if (str.length <= length) {}
 
         return str.substring(0, length) + (dots ? "..." : "");

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:517:13
     static truncate(str, length = 150, dots = true) {
         str = str || "";
 
-        if (str.length <= length) {
+        if (str.length < length) {
             return str;
         }

[NoCoverage] ArithmeticOperator
src/utils/CommonHelper.js:521:16
             return str;
         }
 
-        return str.substring(0, length) + (dots ? "..." : "");
+        return str.substring(0, length) - (dots ? "..." : "");
     }
 

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:521:16
             return str;
         }
 
-        return str.substring(0, length) + (dots ? "..." : "");
+        return str + (dots ? "..." : "");
     }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:530:32
      * @param  {Object} obj
      * @return {Object}
      */
-    static truncateObject(obj) {
-        const truncated = {};
-
-        for (let key in obj) {
-            let value = obj[key];
-
-            if (typeof value === 'string') {
-                value = CommonHelper.truncate(value, 150, true);
-            }
-
-            truncated[key] = value;
-        }
-
-        return truncated;
-    }
+    static truncateObject(obj) {}
 
     /**

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:533:30
     static truncateObject(obj) {
         const truncated = {};
 
-        for (let key in obj) {
-            let value = obj[key];
-
-            if (typeof value === 'string') {
-                value = CommonHelper.truncate(value, 150, true);
-            }
-
-            truncated[key] = value;
-        }
+        for (let key in obj) {}
 
         return truncated;

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:536:44
         for (let key in obj) {
             let value = obj[key];
 
-            if (typeof value === 'string') {
-                value = CommonHelper.truncate(value, 150, true);
-            }
+            if (typeof value === 'string') {}
 
             truncated[key] = value;

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:537:59
             let value = obj[key];
 
             if (typeof value === 'string') {
-                value = CommonHelper.truncate(value, 150, true);
+                value = CommonHelper.truncate(value, 150, false);
             }
 

[NoCoverage] ArrayDeclaration
src/utils/CommonHelper.js:554:54
      * @param  {Array}  [preserved]
      * @return {String}
      */
-    static slugify(str, delimiter = '_', preserved = ['.', '=', '-']) {
+    static slugify(str, delimiter = '_', preserved = []) {
         if (str === '') {
             return '';

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:554:65
      * @param  {Array}  [preserved]
      * @return {String}
      */
-    static slugify(str, delimiter = '_', preserved = ['.', '=', '-']) {
+    static slugify(str, delimiter = '_', preserved = ['.', '=', ""]) {
         if (str === '') {
             return '';

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:555:13
      * @return {String}
      */
     static slugify(str, delimiter = '_', preserved = ['.', '=', '-']) {
-        if (str === '') {
+        if (false) {
             return '';
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:555:13
      * @return {String}
      */
     static slugify(str, delimiter = '_', preserved = ['.', '=', '-']) {
-        if (str === '') {
+        if (true) {
             return '';
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:598:40
         };
 
         // replace special characters
-        for (let k in specialCharsMap) {
-            str = str.replace(specialCharsMap[k], k);
-        }
+        for (let k in specialCharsMap) {}
 
         const slug = str

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:603:60
         }
 
         const slug = str
-            .replace(new RegExp('[' + preserved.join('') + ']', 'g'), ' ') // replace preserved characters with spaces
+            .replace(new RegExp('[' + preserved.join('') + "", 'g'), ' ') // replace preserved characters with spaces
             .replace(/[^\w\ ]/gi, '')                                      // replaces all non-alphanumeric with empty string
             .replace(/\s+/g, delimiter);                                   // collapse whitespaces and replace with `delimiter`

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:603:71
         }
 
         const slug = str
-            .replace(new RegExp('[' + preserved.join('') + ']', 'g'), ' ') // replace preserved characters with spaces
+            .replace(new RegExp('[' + preserved.join('') + ']', 'g'), "") // replace preserved characters with spaces
             .replace(/[^\w\ ]/gi, '')                                      // replaces all non-alphanumeric with empty string
             .replace(/\s+/g, delimiter);                                   // collapse whitespaces and replace with `delimiter`

[NoCoverage] Regex
src/utils/CommonHelper.js:605:22
         const slug = str
             .replace(new RegExp('[' + preserved.join('') + ']', 'g'), ' ') // replace preserved characters with spaces
             .replace(/[^\w\ ]/gi, '')                                      // replaces all non-alphanumeric with empty string
-            .replace(/\s+/g, delimiter);                                   // collapse whitespaces and replace with `delimiter`
+            .replace(/\S+/g, delimiter);                                   // collapse whitespaces and replace with `delimiter`
 
         return slug.charAt(0).toLowerCase() + slug.slice(1);

[NoCoverage] ArithmeticOperator
src/utils/CommonHelper.js:607:16
             .replace(/[^\w\ ]/gi, '')                                      // replaces all non-alphanumeric with empty string
             .replace(/\s+/g, delimiter);                                   // collapse whitespaces and replace with `delimiter`
 
-        return slug.charAt(0).toLowerCase() + slug.slice(1);
+        return slug.charAt(0).toLowerCase() - slug.slice(1);
     }
 

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:607:16
             .replace(/[^\w\ ]/gi, '')                                      // replaces all non-alphanumeric with empty string
             .replace(/\s+/g, delimiter);                                   // collapse whitespaces and replace with `delimiter`
 
-        return slug.charAt(0).toLowerCase() + slug.slice(1);
+        return slug.toLowerCase() + slug.slice(1);
     }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:618:30
      * @param  {String} str
      * @return {String}
      */
-    static escapeRegExp(str) {
-      return str.replace(/[.*+?^${}()|[\]\\]/g, '\\$&'); // $& means the whole matched string
-    }
+    static escapeRegExp(str) {}
 
     /**

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:629:48
      * @param  {String} [separator]
      * @return {Array}
      */
-    static splitNonEmpty(str, separator = ",") {
-        const items = (str || "").split(separator);
-        const result = [];
-
-        for (let item of items) {
-            item = item.trim();
-            if (!CommonHelper.isEmpty(item)) {
-                result.push(item);
-            }
-        }
-
-        return result;
-    }
+    static splitNonEmpty(str, separator = ",") {}
 
     /**

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:629:43
      * @param  {String} [separator]
      * @return {Array}
      */
-    static splitNonEmpty(str, separator = ",") {
+    static splitNonEmpty(str, separator = "") {
         const items = (str || "").split(separator);
         const result = [];

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:630:24
      * @return {Array}
      */
     static splitNonEmpty(str, separator = ",") {
-        const items = (str || "").split(separator);
+        const items = (false).split(separator);
         const result = [];
 

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:630:24
      * @return {Array}
      */
     static splitNonEmpty(str, separator = ",") {
-        const items = (str || "").split(separator);
+        const items = (true).split(separator);
         const result = [];
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:633:33
         const items = (str || "").split(separator);
         const result = [];
 
-        for (let item of items) {
-            item = item.trim();
-            if (!CommonHelper.isEmpty(item)) {
-                result.push(item);
-            }
-        }
+        for (let item of items) {}
 
         return result;

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:634:20
         const result = [];
 
         for (let item of items) {
-            item = item.trim();
+            item = item;
             if (!CommonHelper.isEmpty(item)) {
                 result.push(item);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:635:17
 
         for (let item of items) {
             item = item.trim();
-            if (!CommonHelper.isEmpty(item)) {
+            if (true) {
                 result.push(item);
             }

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:635:17
 
         for (let item of items) {
             item = item.trim();
-            if (!CommonHelper.isEmpty(item)) {
+            if (CommonHelper.isEmpty(item)) {
                 result.push(item);
             }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:650:50
      * @param  {String} [separator]
      * @return {Array}
      */
-    static joinNonEmpty(items, separator = ", ") {
-        const result = [];
-
-        for (let item of items) {
-            item = typeof item === "string" ? item.trim() : "";
-            if (!CommonHelper.isEmpty(item)) {
-                result.push(item);
-            }
-        }
-
-        return result.join(separator);
-    }
+    static joinNonEmpty(items, separator = ", ") {}
 
     /**

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:650:44
      * @param  {String} [separator]
      * @return {Array}
      */
-    static joinNonEmpty(items, separator = ", ") {
+    static joinNonEmpty(items, separator = "") {
         const result = [];
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:653:33
     static joinNonEmpty(items, separator = ", ") {
         const result = [];
 
-        for (let item of items) {
-            item = typeof item === "string" ? item.trim() : "";
-            if (!CommonHelper.isEmpty(item)) {
-                result.push(item);
-            }
-        }
+        for (let item of items) {}
 
         return result.join(separator);

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:654:47
         const result = [];
 
         for (let item of items) {
-            item = typeof item === "string" ? item.trim() : "";
+            item = typeof item === "string" ? item : "";
             if (!CommonHelper.isEmpty(item)) {
                 result.push(item);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:654:20
         const result = [];
 
         for (let item of items) {
-            item = typeof item === "string" ? item.trim() : "";
+            item = true ? item.trim() : "";
             if (!CommonHelper.isEmpty(item)) {
                 result.push(item);

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:655:46
 
         for (let item of items) {
             item = typeof item === "string" ? item.trim() : "";
-            if (!CommonHelper.isEmpty(item)) {
-                result.push(item);
-            }
+            if (!CommonHelper.isEmpty(item)) {}
         }
 

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:655:17
 
         for (let item of items) {
             item = typeof item === "string" ? item.trim() : "";
-            if (!CommonHelper.isEmpty(item)) {
+            if (CommonHelper.isEmpty(item)) {
                 result.push(item);
             }

[Killed] BlockStatement
src/utils/CommonHelper.js:670:29
      * @param  {String} str
      * @return {String}
      */
-    static getInitials(str) {
-        str = (str || '').split('@')[0].trim();
-
-        if (str.length <= 2) {
-            return str.toUpperCase();
-        }
-
-        const parts = str.split(/[\.\_\-\ ]/);
-
-        if (parts.length >= 2) {
-            return (parts[0][0] + parts[1][0]).toUpperCase();
-        }
-
-        return str[0].toUpperCase();
-    }
+    static getInitials(str) {}
 
     /**
killedBy: CommonHelpers.getInitials should return the initials of a name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "JD"
Received: undefined

[Killed] LogicalOperator
src/utils/CommonHelper.js:671:16
      * @return {String}
      */
     static getInitials(str) {
-        str = (str || '').split('@')[0].trim();
+        str = (str && '').split('@')[0].trim();
 
         if (str.length <= 2) {
killedBy: CommonHelpers.getInitials should return the initials of a name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "JD"
Received: ""

[Killed] ConditionalExpression
src/utils/CommonHelper.js:671:16
      * @return {String}
      */
     static getInitials(str) {
-        str = (str || '').split('@')[0].trim();
+        str = (true).split('@')[0].trim();
 
         if (str.length <= 2) {
killedBy: CommonHelpers.getInitials should return the initials of a name
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).split is not a function

[Killed] ConditionalExpression
src/utils/CommonHelper.js:673:13
     static getInitials(str) {
         str = (str || '').split('@')[0].trim();
 
-        if (str.length <= 2) {
+        if (false) {
             return str.toUpperCase();
         }
killedBy: CommonHelpers.getInitials should return the uppercase version of a 2 chars string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "US"
Received: "U"

[Killed] BlockStatement
src/utils/CommonHelper.js:673:30
     static getInitials(str) {
         str = (str || '').split('@')[0].trim();
 
-        if (str.length <= 2) {
-            return str.toUpperCase();
-        }
+        if (str.length <= 2) {}
 
         const parts = str.split(/[\.\_\-\ ]/);
killedBy: CommonHelpers.getInitials should return the uppercase version of a 2 chars string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "US"
Received: "U"

[Killed] MethodExpression
src/utils/CommonHelper.js:674:20
         str = (str || '').split('@')[0].trim();
 
         if (str.length <= 2) {
-            return str.toUpperCase();
+            return str.toLowerCase();
         }
 
killedBy: CommonHelpers.getInitials should return the uppercase version of a 2 chars string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "US"
Received: "us"

[Killed] Regex
src/utils/CommonHelper.js:677:33
             return str.toUpperCase();
         }
 
-        const parts = str.split(/[\.\_\-\ ]/);
+        const parts = str.split(/[^\.\_\-\ ]/);
 
         if (parts.length >= 2) {
killedBy: CommonHelpers.getInitials should return the initials of a name
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).toUpperCase is not a function

[Killed] EqualityOperator
src/utils/CommonHelper.js:679:13
 
         const parts = str.split(/[\.\_\-\ ]/);
 
-        if (parts.length >= 2) {
+        if (parts.length > 2) {
             return (parts[0][0] + parts[1][0]).toUpperCase();
         }
killedBy: CommonHelpers.getInitials should return the initials of a name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "JD"
Received: "J"
