[Killed] EqualityOperator
src/utils/CommonHelper.js:679:13
 
         const parts = str.split(/[\.\_\-\ ]/);
 
-        if (parts.length >= 2) {
+        if (parts.length < 2) {
             return (parts[0][0] + parts[1][0]).toUpperCase();
         }
killedBy: CommonHelpers.getInitials should return the initials of a name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "JD"
Received: "J"

[Killed] ArithmeticOperator
src/utils/CommonHelper.js:680:21
         const parts = str.split(/[\.\_\-\ ]/);
 
         if (parts.length >= 2) {
-            return (parts[0][0] + parts[1][0]).toUpperCase();
+            return (parts[0][0] - parts[1][0]).toUpperCase();
         }
 
killedBy: CommonHelpers.getInitials should return the initials of a name
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).toUpperCase is not a function

[Killed] MethodExpression
src/utils/CommonHelper.js:680:20
         const parts = str.split(/[\.\_\-\ ]/);
 
         if (parts.length >= 2) {
-            return (parts[0][0] + parts[1][0]).toUpperCase();
+            return (parts[0][0] + parts[1][0]).toLowerCase();
         }
 
killedBy: CommonHelpers.getInitials should return the initials of a name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "JD"
Received: "jd"

[Killed] MethodExpression
src/utils/CommonHelper.js:683:16
             return (parts[0][0] + parts[1][0]).toUpperCase();
         }
 
-        return str[0].toUpperCase();
+        return str[0].toLowerCase();
     }
 
killedBy: CommonHelpers.getInitials should return the first char of a username
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "J"
Received: "j"

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:692:30
      * @param  {String|Date} date
      * @return {DateTime}
      */
-    static getDateTime(date) {
-        if (typeof date === 'string') {
-            const formats = {
-                19: "yyyy-MM-dd HH:mm:ss",
-                23: "yyyy-MM-dd HH:mm:ss.SSS",
-                20: "yyyy-MM-dd HH:mm:ssZ",
-                24: "yyyy-MM-dd HH:mm:ss.SSSZ",
-            }
-            const format = formats[date.length] || formats[19];
-            return DateTime.fromFormat(date, format, { zone: 'UTC' });
-        }
-
-        return DateTime.fromJSDate(date);
-    }
+    static getDateTime(date) {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:693:13
      * @return {DateTime}
      */
     static getDateTime(date) {
-        if (typeof date === 'string') {
+        if (true) {
             const formats = {
                 19: "yyyy-MM-dd HH:mm:ss",

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:693:13
      * @return {DateTime}
      */
     static getDateTime(date) {
-        if (typeof date === 'string') {
+        if (typeof date !== 'string') {
             const formats = {
                 19: "yyyy-MM-dd HH:mm:ss",

[NoCoverage] ObjectLiteral
src/utils/CommonHelper.js:694:29
      */
     static getDateTime(date) {
         if (typeof date === 'string') {
-            const formats = {
-                19: "yyyy-MM-dd HH:mm:ss",
-                23: "yyyy-MM-dd HH:mm:ss.SSS",
-                20: "yyyy-MM-dd HH:mm:ssZ",
-                24: "yyyy-MM-dd HH:mm:ss.SSSZ",
-            }
+            const formats = {}
             const format = formats[date.length] || formats[19];
             return DateTime.fromFormat(date, format, { zone: 'UTC' });

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:697:21
             const formats = {
                 19: "yyyy-MM-dd HH:mm:ss",
                 23: "yyyy-MM-dd HH:mm:ss.SSS",
-                20: "yyyy-MM-dd HH:mm:ssZ",
+                20: "",
                 24: "yyyy-MM-dd HH:mm:ss.SSSZ",
             }

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:700:28
                 20: "yyyy-MM-dd HH:mm:ssZ",
                 24: "yyyy-MM-dd HH:mm:ss.SSSZ",
             }
-            const format = formats[date.length] || formats[19];
+            const format = formats[date.length] && formats[19];
             return DateTime.fromFormat(date, format, { zone: 'UTC' });
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:700:28
                 20: "yyyy-MM-dd HH:mm:ssZ",
                 24: "yyyy-MM-dd HH:mm:ss.SSSZ",
             }
-            const format = formats[date.length] || formats[19];
+            const format = true;
             return DateTime.fromFormat(date, format, { zone: 'UTC' });
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:714:66
      * @param  {String}      [format] The result format (see https://moment.github.io/luxon/#/parsing?id=table-of-tokens)
      * @return {String}
      */
-    static formatToUTCDate(date, format = 'yyyy-MM-dd HH:mm:ss') {
-        return CommonHelper.getDateTime(date).toUTC().toFormat(format);
-    }
+    static formatToUTCDate(date, format = 'yyyy-MM-dd HH:mm:ss') {}
 
     /**

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:714:43
      * @param  {String}      [format] The result format (see https://moment.github.io/luxon/#/parsing?id=table-of-tokens)
      * @return {String}
      */
-    static formatToUTCDate(date, format = 'yyyy-MM-dd HH:mm:ss') {
+    static formatToUTCDate(date, format = "") {
         return CommonHelper.getDateTime(date).toUTC().toFormat(format);
     }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:725:68
      * @param  {String}      [format] The result format (see https://moment.github.io/luxon/#/parsing?id=table-of-tokens)
      * @return {String}
      */
-    static formatToLocalDate(date, format = 'yyyy-MM-dd HH:mm:ss') {
-        return CommonHelper.getDateTime(date).toLocal().toFormat(format);
-    }
+    static formatToLocalDate(date, format = 'yyyy-MM-dd HH:mm:ss') {}
 
     /**

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:735:40
      * @param  {String} text
      * @return {Promise}
      */
-    static async copyToClipboard(text) {
-        text = "" + text // ensure that text is string
-
-        if (!text.length || !window?.navigator?.clipboard) {
-            return;
-        }
-
-        return window.navigator.clipboard.writeText(text).catch((err) => {
-            console.warn("Failed to copy.", err);
-        })
-    }
+    static async copyToClipboard(text) {}
 
     /**

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:736:16
      * @return {Promise}
      */
     static async copyToClipboard(text) {
-        text = "" + text // ensure that text is string
+        text = "Stryker was here!" + text // ensure that text is string
 
         if (!text.length || !window?.navigator?.clipboard) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:738:13
     static async copyToClipboard(text) {
         text = "" + text // ensure that text is string
 
-        if (!text.length || !window?.navigator?.clipboard) {
+        if (false) {
             return;
         }

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:738:30
     static async copyToClipboard(text) {
         text = "" + text // ensure that text is string
 
-        if (!text.length || !window?.navigator?.clipboard) {
+        if (!text.length || !window.navigator?.clipboard) {
             return;
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:742:74
             return;
         }
 
-        return window.navigator.clipboard.writeText(text).catch((err) => {
-            console.warn("Failed to copy.", err);
-        })
+        return window.navigator.clipboard.writeText(text).catch((err) => {})
     }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:753:36
      * @param {mixed} obj   The JS object to download.
      * @param {String} name  The result file name.
      */
-    static downloadJson(obj, name) {
-        const encodedObj = "data:text/json;charset=utf-8," + encodeURIComponent(JSON.stringify(obj, null, 2));
-
-        const tempLink = document.createElement('a');
-        tempLink.setAttribute("href", encodedObj);
-        tempLink.setAttribute("download", name + ".json");
-        tempLink.click();
-        tempLink.remove();
-    }
+    static downloadJson(obj, name) {}
 
     /**

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:756:49
     static downloadJson(obj, name) {
         const encodedObj = "data:text/json;charset=utf-8," + encodeURIComponent(JSON.stringify(obj, null, 2));
 
-        const tempLink = document.createElement('a');
+        const tempLink = document.createElement("");
         tempLink.setAttribute("href", encodedObj);
         tempLink.setAttribute("download", name + ".json");

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:769:31
      * @param  {String} jwt
      * @return {Object}
      */
-    static getJWTPayload(jwt) {
-        const raw = (jwt || '').split(".")[1] || '';
-        if (raw === "") {
-            return {};
-        }
-
-        try {
-            const encodedPayload = decodeURIComponent(atob(raw));
-            return JSON.parse(encodedPayload) || {};
-        } catch (err) {
-            console.warn("Failed to parse JWT payload data.", err);
-        }
-
-        return  {};
-    }
+    static getJWTPayload(jwt) {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:770:21
      * @return {Object}
      */
     static getJWTPayload(jwt) {
-        const raw = (jwt || '').split(".")[1] || '';
+        const raw = false;
         if (raw === "") {
             return {};

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:770:22
      * @return {Object}
      */
     static getJWTPayload(jwt) {
-        const raw = (jwt || '').split(".")[1] || '';
+        const raw = (jwt && '').split(".")[1] || '';
         if (raw === "") {
             return {};

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:771:13
      */
     static getJWTPayload(jwt) {
         const raw = (jwt || '').split(".")[1] || '';
-        if (raw === "") {
+        if (true) {
             return {};
         }

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:771:13
      */
     static getJWTPayload(jwt) {
         const raw = (jwt || '').split(".")[1] || '';
-        if (raw === "") {
+        if (raw !== "") {
             return {};
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:775:13
             return {};
         }
 
-        try {
-            const encodedPayload = decodeURIComponent(atob(raw));
-            return JSON.parse(encodedPayload) || {};
-        } catch (err) {
+        try {} catch (err) {
             console.warn("Failed to parse JWT payload data.", err);
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:777:20
 
         try {
             const encodedPayload = decodeURIComponent(atob(raw));
-            return JSON.parse(encodedPayload) || {};
+            return false;
         } catch (err) {
             console.warn("Failed to parse JWT payload data.", err);

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:777:20
 
         try {
             const encodedPayload = decodeURIComponent(atob(raw));
-            return JSON.parse(encodedPayload) || {};
+            return JSON.parse(encodedPayload) && {};
         } catch (err) {
             console.warn("Failed to parse JWT payload data.", err);

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:778:23
         try {
             const encodedPayload = decodeURIComponent(atob(raw));
             return JSON.parse(encodedPayload) || {};
-        } catch (err) {
-            console.warn("Failed to parse JWT payload data.", err);
-        }
+        } catch (err) {}
 
         return  {};

[Killed] BlockStatement
src/utils/CommonHelper.js:791:40
      * @param  {String} filename
      * @return {Boolean}
      */
-    static hasImageExtension(filename) {
-        return !!imageExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
-    }
+    static hasImageExtension(filename) {}
 
     /**
killedBy: CommonHelpers.getFileType should return "image" if the extension is .jpg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image"
Received: "file"

[Killed] MethodExpression
src/utils/CommonHelper.js:792:48
      * @return {Boolean}
      */
     static hasImageExtension(filename) {
-        return !!imageExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
+        return !!imageExtensions.find((ext) => filename.toUpperCase().endsWith(ext));
     }
 
killedBy: CommonHelpers.getFileType should return "image" if the extension is .jpg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image"
Received: "file"

[Killed] BooleanLiteral
src/utils/CommonHelper.js:792:17
      * @return {Boolean}
      */
     static hasImageExtension(filename) {
-        return !!imageExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
+        return !imageExtensions.find(ext => filename.toLowerCase().endsWith(ext));
     }
 
killedBy: CommonHelpers.getFileType should return "image" if the extension is .jpg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image"
Received: "file"

[Killed] BlockStatement
src/utils/CommonHelper.js:801:40
      * @param  {String} filename
      * @return {Boolean}
      */
-    static hasVideoExtension(filename) {
-        return !!videoExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
-    }
+    static hasVideoExtension(filename) {}
 
     /**
killedBy: CommonHelpers.getFileType should return "video" if the extension is .mp4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "video"
Received: "file"

[Killed] ArrowFunction
src/utils/CommonHelper.js:802:39
      * @return {Boolean}
      */
     static hasVideoExtension(filename) {
-        return !!videoExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
+        return !!videoExtensions.find(() => undefined);
     }
 
killedBy: CommonHelpers.getFileType should return "video" if the extension is .mp4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "video"
Received: "file"

[Killed] MethodExpression
src/utils/CommonHelper.js:802:48
      * @return {Boolean}
      */
     static hasVideoExtension(filename) {
-        return !!videoExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
+        return !!videoExtensions.find((ext) => filename.toUpperCase().endsWith(ext));
     }
 
killedBy: CommonHelpers.getFileType should return "video" if the extension is .mp4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "video"
Received: "file"

[Killed] BlockStatement
src/utils/CommonHelper.js:811:40
      * @param  {String} filename
      * @return {Boolean}
      */
-    static hasAudioExtension(filename) {
-        return !!audioExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
-    }
+    static hasAudioExtension(filename) {}
 
     /**
killedBy: CommonHelpers.getFileType should return "audio" if the extension is .aa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audio"
Received: "file"

[Killed] BooleanLiteral
src/utils/CommonHelper.js:812:16
      * @return {Boolean}
      */
     static hasAudioExtension(filename) {
-        return !!audioExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
+        return !audioExtensions.find(ext => filename.toLowerCase().endsWith(ext));
     }
 
killedBy: CommonHelpers.getFileType should return "audio" if the extension is .aa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audio"
Received: "file"

[Killed] MethodExpression
src/utils/CommonHelper.js:812:48
      * @return {Boolean}
      */
     static hasAudioExtension(filename) {
-        return !!audioExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
+        return !!audioExtensions.find((ext) => filename.toLowerCase().startsWith(ext));
     }
 
killedBy: CommonHelpers.getFileType should return "audio" if the extension is .aa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audio"
Received: "file"

[Killed] BlockStatement
src/utils/CommonHelper.js:821:43
      * @param  {String} filename
      * @return {Boolean}
      */
-    static hasDocumentExtension(filename) {
-        return !!documentExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
-    }
+    static hasDocumentExtension(filename) {}
 
     /**
killedBy: CommonHelpers.getFileType should return "document" if the extension is .pdf
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "document"
Received: "file"

[Killed] BooleanLiteral
src/utils/CommonHelper.js:822:16
      * @return {Boolean}
      */
     static hasDocumentExtension(filename) {
-        return !!documentExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
+        return !documentExtensions.find(ext => filename.toLowerCase().endsWith(ext));
     }
 
killedBy: CommonHelpers.getFileType should return "video" if the extension is .mp4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "video"
Received: "document"

[Killed] ArrowFunction
src/utils/CommonHelper.js:822:42
      * @return {Boolean}
      */
     static hasDocumentExtension(filename) {
-        return !!documentExtensions.find((ext) => filename.toLowerCase().endsWith(ext));
+        return !!documentExtensions.find(() => undefined);
     }
 
killedBy: CommonHelpers.getFileType should return "document" if the extension is .pdf
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "document"
Received: "file"

[Killed] BlockStatement
src/utils/CommonHelper.js:831:34
      * @param  {String} filename
      * @return {String}
      */
-    static getFileType(filename) {
-        if (CommonHelper.hasImageExtension(filename)) return "image";
-        if (CommonHelper.hasDocumentExtension(filename)) return "document";
-        if (CommonHelper.hasVideoExtension(filename)) return "video";
-        if (CommonHelper.hasAudioExtension(filename)) return "audio";
-        return "file";
-    }
+    static getFileType(filename) {}
 
     /**
killedBy: CommonHelpers.getFileType should return "image" if the extension is .jpg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image"
Received: undefined

[Killed] ConditionalExpression
src/utils/CommonHelper.js:832:13
      * @return {String}
      */
     static getFileType(filename) {
-        if (CommonHelper.hasImageExtension(filename)) return "image";
+        if (true) return "image";
         if (CommonHelper.hasDocumentExtension(filename)) return "document";
         if (CommonHelper.hasVideoExtension(filename)) return "video";
killedBy: CommonHelpers.getFileType should return "video" if the extension is .mp4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "video"
Received: "image"

[Killed] ConditionalExpression
src/utils/CommonHelper.js:832:13
      * @return {String}
      */
     static getFileType(filename) {
-        if (CommonHelper.hasImageExtension(filename)) return "image";
+        if (false) return "image";
         if (CommonHelper.hasDocumentExtension(filename)) return "document";
         if (CommonHelper.hasVideoExtension(filename)) return "video";
killedBy: CommonHelpers.getFileType should return "image" if the extension is .jpg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image"
Received: "file"

[Killed] ConditionalExpression
src/utils/CommonHelper.js:833:13
      */
     static getFileType(filename) {
         if (CommonHelper.hasImageExtension(filename)) return "image";
-        if (CommonHelper.hasDocumentExtension(filename)) return "document";
+        if (false) return "document";
         if (CommonHelper.hasVideoExtension(filename)) return "video";
         if (CommonHelper.hasAudioExtension(filename)) return "audio";
killedBy: CommonHelpers.getFileType should return "document" if the extension is .pdf
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "document"
Received: "file"

[Killed] ConditionalExpression
src/utils/CommonHelper.js:833:13
      */
     static getFileType(filename) {
         if (CommonHelper.hasImageExtension(filename)) return "image";
-        if (CommonHelper.hasDocumentExtension(filename)) return "document";
+        if (true) return "document";
         if (CommonHelper.hasVideoExtension(filename)) return "video";
         if (CommonHelper.hasAudioExtension(filename)) return "audio";
killedBy: CommonHelpers.getFileType should return "video" if the extension is .mp4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "video"
Received: "document"

[Killed] ConditionalExpression
src/utils/CommonHelper.js:834:13
     static getFileType(filename) {
         if (CommonHelper.hasImageExtension(filename)) return "image";
         if (CommonHelper.hasDocumentExtension(filename)) return "document";
-        if (CommonHelper.hasVideoExtension(filename)) return "video";
+        if (false) return "video";
         if (CommonHelper.hasAudioExtension(filename)) return "audio";
         return "file";
killedBy: CommonHelpers.getFileType should return "video" if the extension is .mp4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "video"
Received: "file"

[Killed] ConditionalExpression
src/utils/CommonHelper.js:834:13
     static getFileType(filename) {
         if (CommonHelper.hasImageExtension(filename)) return "image";
         if (CommonHelper.hasDocumentExtension(filename)) return "document";
-        if (CommonHelper.hasVideoExtension(filename)) return "video";
+        if (true) return "video";
         if (CommonHelper.hasAudioExtension(filename)) return "audio";
         return "file";
killedBy: CommonHelpers.getFileType should return "audio" if the extension is .aa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audio"
Received: "video"

[Killed] ConditionalExpression
src/utils/CommonHelper.js:835:13
         if (CommonHelper.hasImageExtension(filename)) return "image";
         if (CommonHelper.hasDocumentExtension(filename)) return "document";
         if (CommonHelper.hasVideoExtension(filename)) return "video";
-        if (CommonHelper.hasAudioExtension(filename)) return "audio";
+        if (true) return "audio";
         return "file";
     }
killedBy: CommonHelpers.getFileType should return 'file' if the extension is unknown
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "file"
Received: "audio"

[Killed] ConditionalExpression
src/utils/CommonHelper.js:835:13
         if (CommonHelper.hasImageExtension(filename)) return "image";
         if (CommonHelper.hasDocumentExtension(filename)) return "document";
         if (CommonHelper.hasVideoExtension(filename)) return "video";
-        if (CommonHelper.hasAudioExtension(filename)) return "audio";
+        if (false) return "audio";
         return "file";
     }
killedBy: CommonHelpers.getFileType should return "audio" if the extension is .aa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audio"
Received: "file"

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:855:41
             reader.onload = function(e) {
                 let img = new Image();
 
-                img.onload = function() {
-                    let canvas = document.createElement("canvas");
-                    let ctx = canvas.getContext("2d");
-                    let imgWidth = img.width;
-                    let imgHeight = img.height;
-
-                    canvas.width = width;
-                    canvas.height = height;
-
-                    ctx.drawImage(
-                        img,
-                        imgWidth > imgHeight ? (imgWidth - imgHeight) / 2 : 0,
-                        0, // top aligned
-                        // imgHeight > imgWidth ? (imgHeight - imgWidth) / 2 : 0,
-                        imgWidth > imgHeight ? imgHeight : imgWidth,
-                        imgWidth > imgHeight ? imgHeight : imgWidth,
-                        0,
-                        0,
-                        width,
-                        height
-                    );
-
-                    return resolve(canvas.toDataURL(file.type));
-                };
+                img.onload = function() {};
 
                 img.src = e.target.result;

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:856:57
                 let img = new Image();
 
                 img.onload = function() {
-                    let canvas = document.createElement("canvas");
+                    let canvas = document.createElement("");
                     let ctx = canvas.getContext("2d");
                     let imgWidth = img.width;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:866:25
 
                     ctx.drawImage(
                         img,
-                        imgWidth > imgHeight ? (imgWidth - imgHeight) / 2 : 0,
+                        false ? (imgWidth - imgHeight) / 2 : 0,
                         0, // top aligned
                         // imgHeight > imgWidth ? (imgHeight - imgWidth) / 2 : 0,

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:866:25
 
                     ctx.drawImage(
                         img,
-                        imgWidth > imgHeight ? (imgWidth - imgHeight) / 2 : 0,
+                        true ? (imgWidth - imgHeight) / 2 : 0,
                         0, // top aligned
                         // imgHeight > imgWidth ? (imgHeight - imgWidth) / 2 : 0,

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:869:25
                         imgWidth > imgHeight ? (imgWidth - imgHeight) / 2 : 0,
                         0, // top aligned
                         // imgHeight > imgWidth ? (imgHeight - imgWidth) / 2 : 0,
-                        imgWidth > imgHeight ? imgHeight : imgWidth,
+                        false ? imgHeight : imgWidth,
                         imgWidth > imgHeight ? imgHeight : imgWidth,
                         0,

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:869:25
                         imgWidth > imgHeight ? (imgWidth - imgHeight) / 2 : 0,
                         0, // top aligned
                         // imgHeight > imgWidth ? (imgHeight - imgWidth) / 2 : 0,
-                        imgWidth > imgHeight ? imgHeight : imgWidth,
+                        imgWidth >= imgHeight ? imgHeight : imgWidth,
                         imgWidth > imgHeight ? imgHeight : imgWidth,
                         0,

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:870:25
                         0, // top aligned
                         // imgHeight > imgWidth ? (imgHeight - imgWidth) / 2 : 0,
                         imgWidth > imgHeight ? imgHeight : imgWidth,
-                        imgWidth > imgHeight ? imgHeight : imgWidth,
+                        imgWidth >= imgHeight ? imgHeight : imgWidth,
                         0,
                         0,

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:870:25
                         0, // top aligned
                         // imgHeight > imgWidth ? (imgHeight - imgWidth) / 2 : 0,
                         imgWidth > imgHeight ? imgHeight : imgWidth,
-                        imgWidth > imgHeight ? imgHeight : imgWidth,
+                        imgWidth <= imgHeight ? imgHeight : imgWidth,
                         0,
                         0,

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:894:53
      * @param {string}   key
      * @param {mixed}    value
      */
-    static addValueToFormData(formData, key, value) {
-        if (typeof value === "undefined") {
-            return;
-        }
-
-        if (CommonHelper.isEmpty(value)) {
-            formData.append(key, "");
-        } else if (Array.isArray(value)) {
-            for (const item of value) {
-                CommonHelper.addValueToFormData(formData, key, item);
-            }
-        } else if (value instanceof File) {
-            formData.append(key, value);
-        } else if (value instanceof Date) {
-            formData.append(key, value.toISOString());
-        } else if (CommonHelper.isObject(value)) {
-            formData.append(key, JSON.stringify(value));
-        } else {
-            formData.append(key, "" + value);
-        }
-    }
+    static addValueToFormData(formData, key, value) {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:895:13
      * @param {mixed}    value
      */
     static addValueToFormData(formData, key, value) {
-        if (typeof value === "undefined") {
+        if (true) {
             return;
         }

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:895:13
      * @param {mixed}    value
      */
     static addValueToFormData(formData, key, value) {
-        if (typeof value === "undefined") {
+        if (typeof value !== "undefined") {
             return;
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:899:13
             return;
         }
 
-        if (CommonHelper.isEmpty(value)) {
+        if (true) {
             formData.append(key, "");
         } else if (Array.isArray(value)) {
