[NoCoverage] BlockStatement
src/utils/CommonHelper.js:899:42
             return;
         }
 
-        if (CommonHelper.isEmpty(value)) {
-            formData.append(key, "");
-        } else if (Array.isArray(value)) {
+        if (CommonHelper.isEmpty(value)) {} else if (Array.isArray(value)) {
             for (const item of value) {
                 CommonHelper.addValueToFormData(formData, key, item);

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:900:34
         }
 
         if (CommonHelper.isEmpty(value)) {
-            formData.append(key, "");
+            formData.append(key, "Stryker was here!");
         } else if (Array.isArray(value)) {
             for (const item of value) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:901:20
 
         if (CommonHelper.isEmpty(value)) {
             formData.append(key, "");
-        } else if (Array.isArray(value)) {
+        } else if (true) {
             for (const item of value) {
                 CommonHelper.addValueToFormData(formData, key, item);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:901:20
 
         if (CommonHelper.isEmpty(value)) {
             formData.append(key, "");
-        } else if (Array.isArray(value)) {
+        } else if (false) {
             for (const item of value) {
                 CommonHelper.addValueToFormData(formData, key, item);

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:902:39
         if (CommonHelper.isEmpty(value)) {
             formData.append(key, "");
         } else if (Array.isArray(value)) {
-            for (const item of value) {
-                CommonHelper.addValueToFormData(formData, key, item);
-            }
+            for (const item of value) {}
         } else if (value instanceof File) {
             formData.append(key, value);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:905:20
             for (const item of value) {
                 CommonHelper.addValueToFormData(formData, key, item);
             }
-        } else if (value instanceof File) {
+        } else if (true) {
             formData.append(key, value);
         } else if (value instanceof Date) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:905:43
             for (const item of value) {
                 CommonHelper.addValueToFormData(formData, key, item);
             }
-        } else if (value instanceof File) {
-            formData.append(key, value);
-        } else if (value instanceof Date) {
+        } else if (value instanceof File) {} else if (value instanceof Date) {
             formData.append(key, value.toISOString());
         } else if (CommonHelper.isObject(value)) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:907:20
             }
         } else if (value instanceof File) {
             formData.append(key, value);
-        } else if (value instanceof Date) {
+        } else if (true) {
             formData.append(key, value.toISOString());
         } else if (CommonHelper.isObject(value)) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:907:20
             }
         } else if (value instanceof File) {
             formData.append(key, value);
-        } else if (value instanceof Date) {
+        } else if (false) {
             formData.append(key, value.toISOString());
         } else if (CommonHelper.isObject(value)) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:909:20
             formData.append(key, value);
         } else if (value instanceof Date) {
             formData.append(key, value.toISOString());
-        } else if (CommonHelper.isObject(value)) {
+        } else if (false) {
             formData.append(key, JSON.stringify(value));
         } else {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:909:50
             formData.append(key, value);
         } else if (value instanceof Date) {
             formData.append(key, value.toISOString());
-        } else if (CommonHelper.isObject(value)) {
-            formData.append(key, JSON.stringify(value));
-        } else {
+        } else if (CommonHelper.isObject(value)) {} else {
             formData.append(key, "" + value);
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:911:16
             formData.append(key, value.toISOString());
         } else if (CommonHelper.isObject(value)) {
             formData.append(key, JSON.stringify(value));
-        } else {
-            formData.append(key, "" + value);
-        }
+        } else {}
     }
 

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:912:34
         } else if (CommonHelper.isObject(value)) {
             formData.append(key, JSON.stringify(value));
         } else {
-            formData.append(key, "" + value);
+            formData.append(key, "Stryker was here!" + value);
         }
     }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:923:24
      * @return {Object}
      */
     static dummyCollectionRecord(collection) {
-        const fields = collection?.schema || [];
+        const fields = true;
 
         const dummy = {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:923:24
      * @return {Object}
      */
     static dummyCollectionRecord(collection) {
-        const fields = collection?.schema || [];
+        const fields = false;
 
         const dummy = {

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:927:29
 
         const dummy = {
             "id": "RECORD_ID",
-            "collectionId": collection?.id,
+            "collectionId": collection.id,
             "collectionName": collection?.name,
         };

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:928:31
         const dummy = {
             "id": "RECORD_ID",
             "collectionId": collection?.id,
-            "collectionName": collection?.name,
+            "collectionName": collection.name,
         };
 

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:931:13
             "collectionName": collection?.name,
         };
 
-        if (collection?.isAuth) {
+        if (collection.isAuth) {
             dummy["username"] = "username123";
             dummy["verified"] = false;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:931:13
             "collectionName": collection?.name,
         };
 
-        if (collection?.isAuth) {
+        if (false) {
             dummy["username"] = "username123";
             dummy["verified"] = false;

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:933:33
 
         if (collection?.isAuth) {
             dummy["username"] = "username123";
-            dummy["verified"] = false;
+            dummy["verified"] = true;
             dummy["emailVisibility"] = true;
             dummy["email"] = "test@example.com";

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:934:40
         if (collection?.isAuth) {
             dummy["username"] = "username123";
             dummy["verified"] = false;
-            dummy["emailVisibility"] = true;
+            dummy["emailVisibility"] = false;
             dummy["email"] = "test@example.com";
         }

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:934:19
         if (collection?.isAuth) {
             dummy["username"] = "username123";
             dummy["verified"] = false;
-            dummy["emailVisibility"] = true;
+            dummy[""] = true;
             dummy["email"] = "test@example.com";
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:938:28
             dummy["email"] = "test@example.com";
         }
 
-        const hasCreated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("created");
+        const hasCreated = false;
         if (hasCreated) {
             dummy["created"] = "2022-01-01 01:00:00.123Z";

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:938:28
             dummy["email"] = "test@example.com";
         }
 
-        const hasCreated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("created");
+        const hasCreated = !collection?.$isView && CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("created");
         if (hasCreated) {
             dummy["created"] = "2022-01-01 01:00:00.123Z";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:939:13
         }
 
         const hasCreated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("created");
-        if (hasCreated) {
+        if (false) {
             dummy["created"] = "2022-01-01 01:00:00.123Z";
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:939:25
         }
 
         const hasCreated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("created");
-        if (hasCreated) {
-            dummy["created"] = "2022-01-01 01:00:00.123Z";
-        }
+        if (hasCreated) {}
 
         const hasUpdated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("updated");

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:940:32
 
         const hasCreated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("created");
         if (hasCreated) {
-            dummy["created"] = "2022-01-01 01:00:00.123Z";
+            dummy["created"] = "";
         }
 

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:940:19
 
         const hasCreated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("created");
         if (hasCreated) {
-            dummy["created"] = "2022-01-01 01:00:00.123Z";
+            dummy[""] = "2022-01-01 01:00:00.123Z";
         }
 

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:943:89
             dummy["created"] = "2022-01-01 01:00:00.123Z";
         }
 
-        const hasUpdated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("updated");
+        const hasUpdated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options.query).includes("updated");
         if (hasUpdated) {
             dummy["updated"] = "2022-01-01 23:59:59.456Z";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:943:28
             dummy["created"] = "2022-01-01 01:00:00.123Z";
         }
 
-        const hasUpdated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("updated");
+        const hasUpdated = false;
         if (hasUpdated) {
             dummy["updated"] = "2022-01-01 23:59:59.456Z";

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:944:25
         }
 
         const hasUpdated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("updated");
-        if (hasUpdated) {
-            dummy["updated"] = "2022-01-01 23:59:59.456Z";
-        }
+        if (hasUpdated) {}
 
         for (const field of fields) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:944:13
         }
 
         const hasUpdated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("updated");
-        if (hasUpdated) {
+        if (true) {
             dummy["updated"] = "2022-01-01 23:59:59.456Z";
         }

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:945:19
 
         const hasUpdated = !collection?.$isView || CommonHelper.extractColumnsFromQuery(collection?.options?.query).includes("updated");
         if (hasUpdated) {
-            dummy["updated"] = "2022-01-01 23:59:59.456Z";
+            dummy[""] = "2022-01-01 23:59:59.456Z";
         }
 

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:950:17
 
         for (const field of fields) {
             let val = null;
-            if (field.type === "number") {
+            if (true) {
                 val = 123;
             } else if (field.type === "date") {

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:950:17
 
         for (const field of fields) {
             let val = null;
-            if (field.type === "number") {
+            if (field.type !== "number") {
                 val = 123;
             } else if (field.type === "date") {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:952:24
             let val = null;
             if (field.type === "number") {
                 val = 123;
-            } else if (field.type === "date") {
+            } else if (true) {
                 val = "2022-01-01 10:00:00.123Z";
             } else if (field.type === "bool") {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:952:24
             let val = null;
             if (field.type === "number") {
                 val = 123;
-            } else if (field.type === "date") {
+            } else if (false) {
                 val = "2022-01-01 10:00:00.123Z";
             } else if (field.type === "bool") {

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:953:23
             if (field.type === "number") {
                 val = 123;
             } else if (field.type === "date") {
-                val = "2022-01-01 10:00:00.123Z";
+                val = "";
             } else if (field.type === "bool") {
                 val = true;

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:954:24
                 val = 123;
             } else if (field.type === "date") {
                 val = "2022-01-01 10:00:00.123Z";
-            } else if (field.type === "bool") {
+            } else if (field.type !== "bool") {
                 val = true;
             } else if (field.type === "email") {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:954:24
                 val = 123;
             } else if (field.type === "date") {
                 val = "2022-01-01 10:00:00.123Z";
-            } else if (field.type === "bool") {
+            } else if (true) {
                 val = true;
             } else if (field.type === "email") {

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:955:23
             } else if (field.type === "date") {
                 val = "2022-01-01 10:00:00.123Z";
             } else if (field.type === "bool") {
-                val = true;
+                val = false;
             } else if (field.type === "email") {
                 val = "test@example.com";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:956:24
                 val = "2022-01-01 10:00:00.123Z";
             } else if (field.type === "bool") {
                 val = true;
-            } else if (field.type === "email") {
+            } else if (false) {
                 val = "test@example.com";
             } else if (field.type === "url") {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:956:48
                 val = "2022-01-01 10:00:00.123Z";
             } else if (field.type === "bool") {
                 val = true;
-            } else if (field.type === "email") {
-                val = "test@example.com";
-            } else if (field.type === "url") {
+            } else if (field.type === "email") {} else if (field.type === "url") {
                 val = "https://example.com";
             } else if (field.type === "json") {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:958:46
                 val = true;
             } else if (field.type === "email") {
                 val = "test@example.com";
-            } else if (field.type === "url") {
-                val = "https://example.com";
-            } else if (field.type === "json") {
+            } else if (field.type === "url") {} else if (field.type === "json") {
                 val = 'JSON';
             } else if (field.type === "file") {

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:958:24
                 val = true;
             } else if (field.type === "email") {
                 val = "test@example.com";
-            } else if (field.type === "url") {
+            } else if (field.type !== "url") {
                 val = "https://example.com";
             } else if (field.type === "json") {

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:959:23
             } else if (field.type === "email") {
                 val = "test@example.com";
             } else if (field.type === "url") {
-                val = "https://example.com";
+                val = "";
             } else if (field.type === "json") {
                 val = 'JSON';

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:960:24
                 val = "test@example.com";
             } else if (field.type === "url") {
                 val = "https://example.com";
-            } else if (field.type === "json") {
+            } else if (true) {
                 val = 'JSON';
             } else if (field.type === "file") {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:960:24
                 val = "test@example.com";
             } else if (field.type === "url") {
                 val = "https://example.com";
-            } else if (field.type === "json") {
+            } else if (false) {
                 val = 'JSON';
             } else if (field.type === "file") {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:962:24
                 val = "https://example.com";
             } else if (field.type === "json") {
                 val = 'JSON';
-            } else if (field.type === "file") {
+            } else if (true) {
                 val = 'filename.jpg';
                 if (field.options?.maxSelect !== 1) {

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:962:24
                 val = "https://example.com";
             } else if (field.type === "json") {
                 val = 'JSON';
-            } else if (field.type === "file") {
+            } else if (field.type !== "file") {
                 val = 'filename.jpg';
                 if (field.options?.maxSelect !== 1) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:964:53
                 val = 'JSON';
             } else if (field.type === "file") {
                 val = 'filename.jpg';
-                if (field.options?.maxSelect !== 1) {
-                    val = [val];
-                }
+                if (field.options?.maxSelect !== 1) {}
             } else if (field.type === "select") {
                 val = field.options?.values?.[0];

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:964:21
                 val = 'JSON';
             } else if (field.type === "file") {
                 val = 'filename.jpg';
-                if (field.options?.maxSelect !== 1) {
+                if (true) {
                     val = [val];
                 }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:967:24
                 if (field.options?.maxSelect !== 1) {
                     val = [val];
                 }
-            } else if (field.type === "select") {
+            } else if (true) {
                 val = field.options?.values?.[0];
                 if (field.options?.maxSelect !== 1) {

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:967:24
                 if (field.options?.maxSelect !== 1) {
                     val = [val];
                 }
-            } else if (field.type === "select") {
+            } else if (field.type !== "select") {
                 val = field.options?.values?.[0];
                 if (field.options?.maxSelect !== 1) {

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:968:23
                     val = [val];
                 }
             } else if (field.type === "select") {
-                val = field.options?.values?.[0];
+                val = field.options.values?.[0];
                 if (field.options?.maxSelect !== 1) {
                     val = [val];

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:968:23
                     val = [val];
                 }
             } else if (field.type === "select") {
-                val = field.options?.values?.[0];
+                val = field.options?.values[0];
                 if (field.options?.maxSelect !== 1) {
                     val = [val];

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:969:21
                 }
             } else if (field.type === "select") {
                 val = field.options?.values?.[0];
-                if (field.options?.maxSelect !== 1) {
+                if (field.options?.maxSelect === 1) {
                     val = [val];
                 }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:969:53
                 }
             } else if (field.type === "select") {
                 val = field.options?.values?.[0];
-                if (field.options?.maxSelect !== 1) {
-                    val = [val];
-                }
+                if (field.options?.maxSelect !== 1) {}
             } else if (field.type === "relation") {
                 val = 'RELATION_RECORD_ID';

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:972:24
                 if (field.options?.maxSelect !== 1) {
                     val = [val];
                 }
-            } else if (field.type === "relation") {
+            } else if (field.type !== "relation") {
                 val = 'RELATION_RECORD_ID';
                 if (field.options?.maxSelect !== 1) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:972:51
                 if (field.options?.maxSelect !== 1) {
                     val = [val];
                 }
-            } else if (field.type === "relation") {
-                val = 'RELATION_RECORD_ID';
-                if (field.options?.maxSelect !== 1) {
-                    val = [val];
-                }
-            } else {
+            } else if (field.type === "relation") {} else {
                 val = "test";
             }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:974:21
                 }
             } else if (field.type === "relation") {
                 val = 'RELATION_RECORD_ID';
-                if (field.options?.maxSelect !== 1) {
+                if (true) {
                     val = [val];
                 }

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:974:21
                 }
             } else if (field.type === "relation") {
                 val = 'RELATION_RECORD_ID';
-                if (field.options?.maxSelect !== 1) {
+                if (field.options.maxSelect !== 1) {
                     val = [val];
                 }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:977:20
                 if (field.options?.maxSelect !== 1) {
                     val = [val];
                 }
-            } else {
-                val = "test";
-            }
+            } else {}
 
             dummy[field.name] = val;

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:994:24
      * @return {Object}
      */
     static dummyCollectionSchemaData(collection) {
-        const fields = collection?.schema || [];
+        const fields = collection.schema || [];
 
         const dummy = {};

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:994:24
      * @return {Object}
      */
     static dummyCollectionSchemaData(collection) {
-        const fields = collection?.schema || [];
+        const fields = false;
 
         const dummy = {};

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:1001:17
         for (const field of fields) {
             let val = null;
 
-            if (field.type === "number") {
+            if (field.type !== "number") {
                 val = 123;
             } else if (field.type === "date") {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1001:42
         for (const field of fields) {
             let val = null;
 
-            if (field.type === "number") {
-                val = 123;
-            } else if (field.type === "date") {
+            if (field.type === "number") {} else if (field.type === "date") {
                 val = "2022-01-01 10:00:00.123Z";
             } else if (field.type === "bool") {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1003:47
 
             if (field.type === "number") {
                 val = 123;
-            } else if (field.type === "date") {
-                val = "2022-01-01 10:00:00.123Z";
-            } else if (field.type === "bool") {
+            } else if (field.type === "date") {} else if (field.type === "bool") {
                 val = true;
             } else if (field.type === "email") {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1005:47
                 val = 123;
             } else if (field.type === "date") {
                 val = "2022-01-01 10:00:00.123Z";
-            } else if (field.type === "bool") {
-                val = true;
-            } else if (field.type === "email") {
+            } else if (field.type === "bool") {} else if (field.type === "email") {
                 val = "test@example.com";
             } else if (field.type === "url") {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1007:24
                 val = "2022-01-01 10:00:00.123Z";
             } else if (field.type === "bool") {
                 val = true;
-            } else if (field.type === "email") {
+            } else if (true) {
                 val = "test@example.com";
             } else if (field.type === "url") {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1009:24
                 val = true;
             } else if (field.type === "email") {
                 val = "test@example.com";
-            } else if (field.type === "url") {
+            } else if (false) {
                 val = "https://example.com";
             } else if (field.type === "json") {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1011:47
                 val = "test@example.com";
             } else if (field.type === "url") {
                 val = "https://example.com";
-            } else if (field.type === "json") {
-                val = 'JSON';
-            } else if (field.type === "file") {
+            } else if (field.type === "json") {} else if (field.type === "file") {
                 continue; // currently file upload is supported only via FormData
             } else if (field.type === "select") {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1015:49
                 val = 'JSON';
             } else if (field.type === "file") {
                 continue; // currently file upload is supported only via FormData
-            } else if (field.type === "select") {
-                val = field.options?.values?.[0];
-                if (field.options?.maxSelect !== 1) {
-                    val = [val];
-                }
-            } else if (field.type === "relation") {
+            } else if (field.type === "select") {} else if (field.type === "relation") {
                 val = 'RELATION_RECORD_ID';
                 if (field.options?.maxSelect !== 1) {

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:1015:24
                 val = 'JSON';
             } else if (field.type === "file") {
                 continue; // currently file upload is supported only via FormData
-            } else if (field.type === "select") {
+            } else if (field.type !== "select") {
                 val = field.options?.values?.[0];
                 if (field.options?.maxSelect !== 1) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1017:21
                 continue; // currently file upload is supported only via FormData
             } else if (field.type === "select") {
                 val = field.options?.values?.[0];
-                if (field.options?.maxSelect !== 1) {
+                if (true) {
                     val = [val];
                 }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1020:24
                 if (field.options?.maxSelect !== 1) {
                     val = [val];
                 }
-            } else if (field.type === "relation") {
+            } else if (false) {
                 val = 'RELATION_RECORD_ID';
                 if (field.options?.maxSelect !== 1) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1020:24
                 if (field.options?.maxSelect !== 1) {
                     val = [val];
                 }
-            } else if (field.type === "relation") {
+            } else if (true) {
                 val = 'RELATION_RECORD_ID';
                 if (field.options?.maxSelect !== 1) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1022:21
                 }
             } else if (field.type === "relation") {
                 val = 'RELATION_RECORD_ID';
-                if (field.options?.maxSelect !== 1) {
+                if (false) {
                     val = [val];
                 }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1041:40
      * @param  {String} type
      * @return {String}
      */
-    static getCollectionTypeIcon(type) {
-        switch (type?.toLowerCase()) {
-            case "auth":
-                return "ri-group-line";
-            case "view":
-                return "ri-table-line";
-            default:
-                return "ri-folder-2-line";
-        }
-    }
+    static getCollectionTypeIcon(type) {}
 
     /**

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:1042:17
      * @return {String}
      */
     static getCollectionTypeIcon(type) {
-        switch (type?.toLowerCase()) {
+        switch (type.toLowerCase()) {
             case "auth":
                 return "ri-group-line";
