[NoCoverage] MethodExpression
src/utils/CommonHelper.js:1042:17
      * @return {String}
      */
     static getCollectionTypeIcon(type) {
-        switch (type?.toLowerCase()) {
+        switch (type?.toUpperCase()) {
             case "auth":
                 return "ri-group-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1043:13
      */
     static getCollectionTypeIcon(type) {
         switch (type?.toLowerCase()) {
-            case "auth":
-                return "ri-group-line";
+            case "auth":
             case "view":
                 return "ri-table-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1045:13
         switch (type?.toLowerCase()) {
             case "auth":
                 return "ri-group-line";
-            case "view":
-                return "ri-table-line";
+            case "view":
             default:
                 return "ri-folder-2-line";

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1046:24
             case "auth":
                 return "ri-group-line";
             case "view":
-                return "ri-table-line";
+                return "";
             default:
                 return "ri-folder-2-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1047:13
                 return "ri-group-line";
             case "view":
                 return "ri-table-line";
-            default:
-                return "ri-folder-2-line";
+            default:
         }
     }

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1048:24
             case "view":
                 return "ri-table-line";
             default:
-                return "ri-folder-2-line";
+                return "";
         }
     }

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:1059:17
      * @return {String}
      */
     static getFieldTypeIcon(type) {
-        switch (type?.toLowerCase()) {
+        switch (type.toLowerCase()) {
             case "primary":
                 return "ri-key-line";

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:1059:17
      * @return {String}
      */
     static getFieldTypeIcon(type) {
-        switch (type?.toLowerCase()) {
+        switch (type?.toUpperCase()) {
             case "primary":
                 return "ri-key-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1060:13
      */
     static getFieldTypeIcon(type) {
         switch (type?.toLowerCase()) {
-            case "primary":
-                return "ri-key-line";
+            case "primary":
             case "text":
                 return "ri-text";

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1060:18
      */
     static getFieldTypeIcon(type) {
         switch (type?.toLowerCase()) {
-            case "primary":
+            case "":
                 return "ri-key-line";
             case "text":

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1061:24
     static getFieldTypeIcon(type) {
         switch (type?.toLowerCase()) {
             case "primary":
-                return "ri-key-line";
+                return "";
             case "text":
                 return "ri-text";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1062:13
         switch (type?.toLowerCase()) {
             case "primary":
                 return "ri-key-line";
-            case "text":
-                return "ri-text";
+            case "text":
             case "number":
                 return "ri-hashtag";

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1062:18
         switch (type?.toLowerCase()) {
             case "primary":
                 return "ri-key-line";
-            case "text":
+            case "":
                 return "ri-text";
             case "number":

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1064:13
                 return "ri-key-line";
             case "text":
                 return "ri-text";
-            case "number":
-                return "ri-hashtag";
+            case "number":
             case "date":
                 return "ri-calendar-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1066:13
                 return "ri-text";
             case "number":
                 return "ri-hashtag";
-            case "date":
-                return "ri-calendar-line";
+            case "date":
             case "bool":
                 return "ri-toggle-line";

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1067:24
             case "number":
                 return "ri-hashtag";
             case "date":
-                return "ri-calendar-line";
+                return "";
             case "bool":
                 return "ri-toggle-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1068:13
                 return "ri-hashtag";
             case "date":
                 return "ri-calendar-line";
-            case "bool":
-                return "ri-toggle-line";
+            case "bool":
             case "email":
                 return "ri-mail-line";

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1069:24
             case "date":
                 return "ri-calendar-line";
             case "bool":
-                return "ri-toggle-line";
+                return "";
             case "email":
                 return "ri-mail-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1070:13
                 return "ri-calendar-line";
             case "bool":
                 return "ri-toggle-line";
-            case "email":
-                return "ri-mail-line";
+            case "email":
             case "url":
                 return "ri-link";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1072:13
                 return "ri-toggle-line";
             case "email":
                 return "ri-mail-line";
-            case "url":
-                return "ri-link";
+            case "url":
             case "editor":
                 return "ri-edit-2-line";

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1072:18
                 return "ri-toggle-line";
             case "email":
                 return "ri-mail-line";
-            case "url":
+            case "":
                 return "ri-link";
             case "editor":

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1073:24
             case "email":
                 return "ri-mail-line";
             case "url":
-                return "ri-link";
+                return "";
             case "editor":
                 return "ri-edit-2-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1074:13
                 return "ri-mail-line";
             case "url":
                 return "ri-link";
-            case "editor":
-                return "ri-edit-2-line";
+            case "editor":
             case "select":
                 return "ri-list-check";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1076:13
                 return "ri-link";
             case "editor":
                 return "ri-edit-2-line";
-            case "select":
-                return "ri-list-check";
+            case "select":
             case "json":
                 return "ri-braces-line";

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1076:18
                 return "ri-link";
             case "editor":
                 return "ri-edit-2-line";
-            case "select":
+            case "":
                 return "ri-list-check";
             case "json":

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1077:24
             case "editor":
                 return "ri-edit-2-line";
             case "select":
-                return "ri-list-check";
+                return "";
             case "json":
                 return "ri-braces-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1078:13
                 return "ri-edit-2-line";
             case "select":
                 return "ri-list-check";
-            case "json":
-                return "ri-braces-line";
+            case "json":
             case "file":
                 return "ri-image-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1080:13
                 return "ri-list-check";
             case "json":
                 return "ri-braces-line";
-            case "file":
-                return "ri-image-line";
+            case "file":
             case "relation":
                 return "ri-mind-map";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1082:13
                 return "ri-braces-line";
             case "file":
                 return "ri-image-line";
-            case "relation":
-                return "ri-mind-map";
+            case "relation":
             case "user":
                 return "ri-user-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1084:13
                 return "ri-image-line";
             case "relation":
                 return "ri-mind-map";
-            case "user":
-                return "ri-user-line";
+            case "user":
             default:
                 return "ri-star-s-line";

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1085:24
             case "relation":
                 return "ri-mind-map";
             case "user":
-                return "ri-user-line";
+                return "";
             default:
                 return "ri-star-s-line";

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1086:13
                 return "ri-mind-map";
             case "user":
                 return "ri-user-line";
-            default:
-                return "ri-star-s-line";
+            default:
         }
     }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1097:37
      * @param  {Object} field
      * @return {String}
      */
-    static getFieldValueType(field) {
-        switch (field?.type) {
-            case 'bool':
-                return 'Boolean';
-            case 'number':
-                return 'Number';
-            case 'file':
-                return 'File';
-            case 'select':
-            case 'relation':
-                if (field?.options?.maxSelect === 1) {
-                    return 'String';
-                }
-                return 'Array<String>';
-            default:
-                return 'String';
-        }
-    }
+    static getFieldValueType(field) {}
 
     /**

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:1098:17
      * @return {String}
      */
     static getFieldValueType(field) {
-        switch (field?.type) {
+        switch (field.type) {
             case 'bool':
                 return 'Boolean';

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1099:13
      */
     static getFieldValueType(field) {
         switch (field?.type) {
-            case 'bool':
-                return 'Boolean';
+            case 'bool':
             case 'number':
                 return 'Number';

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1101:13
         switch (field?.type) {
             case 'bool':
                 return 'Boolean';
-            case 'number':
-                return 'Number';
+            case 'number':
             case 'file':
                 return 'File';

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1103:13
                 return 'Boolean';
             case 'number':
                 return 'Number';
-            case 'file':
-                return 'File';
+            case 'file':
             case 'select':
             case 'relation':

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1103:18
                 return 'Boolean';
             case 'number':
                 return 'Number';
-            case 'file':
+            case "":
                 return 'File';
             case 'select':

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1104:24
             case 'number':
                 return 'Number';
             case 'file':
-                return 'File';
+                return "";
             case 'select':
             case 'relation':

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1105:18
                 return 'Number';
             case 'file':
                 return 'File';
-            case 'select':
+            case "":
             case 'relation':
                 if (field?.options?.maxSelect === 1) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1106:13
             case 'file':
                 return 'File';
             case 'select':
-            case 'relation':
-                if (field?.options?.maxSelect === 1) {
-                    return 'String';
-                }
-                return 'Array<String>';
+            case 'relation':
             default:
                 return 'String';

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:1107:21
                 return 'File';
             case 'select':
             case 'relation':
-                if (field?.options?.maxSelect === 1) {
+                if (field?.options?.maxSelect !== 1) {
                     return 'String';
                 }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1107:54
                 return 'File';
             case 'select':
             case 'relation':
-                if (field?.options?.maxSelect === 1) {
-                    return 'String';
-                }
+                if (field?.options?.maxSelect === 1) {}
                 return 'Array<String>';
             default:

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1108:28
             case 'select':
             case 'relation':
                 if (field?.options?.maxSelect === 1) {
-                    return 'String';
+                    return "";
                 }
                 return 'Array<String>';

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1111:13
                     return 'String';
                 }
                 return 'Array<String>';
-            default:
-                return 'String';
+            default:
         }
     }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1122:34
      * @param  {Object} field
      * @return {String}
      */
-    static zeroDefaultStr(field) {
-        if (field?.type === "number") {
-            return "0";
-        }
-
-        if (field?.type === "bool") {
-            return "false";
-        }
-
-        if (field?.type === "json") {
-            return 'null, "", [], {}';
-        }
-
-        // arrayable fields
-        if (["select", "relation", "file"].includes(field?.type) && field?.options?.maxSelect != 1) {
-            return "[]";
-        }
-
-        return '""';
-    }
+    static zeroDefaultStr(field) {}
 
     /**

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1123:13
      * @return {String}
      */
     static zeroDefaultStr(field) {
-        if (field?.type === "number") {
+        if (true) {
             return "0";
         }

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:1123:13
      * @return {String}
      */
     static zeroDefaultStr(field) {
-        if (field?.type === "number") {
+        if (field.type === "number") {
             return "0";
         }

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1124:20
      */
     static zeroDefaultStr(field) {
         if (field?.type === "number") {
-            return "0";
+            return "";
         }
 

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:1127:13
             return "0";
         }
 
-        if (field?.type === "bool") {
+        if (field.type === "bool") {
             return "false";
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1127:13
             return "0";
         }
 
-        if (field?.type === "bool") {
+        if (true) {
             return "false";
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1131:13
             return "false";
         }
 
-        if (field?.type === "json") {
+        if (false) {
             return 'null, "", [], {}';
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1131:37
             return "false";
         }
 
-        if (field?.type === "json") {
-            return 'null, "", [], {}';
-        }
+        if (field?.type === "json") {}
 
         // arrayable fields

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1136:101
         }
 
         // arrayable fields
-        if (["select", "relation", "file"].includes(field?.type) && field?.options?.maxSelect != 1) {
-            return "[]";
-        }
+        if (["select", "relation", "file"].includes(field?.type) && field?.options?.maxSelect != 1) {}
 
         return '""';

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1136:13
         }
 
         // arrayable fields
-        if (["select", "relation", "file"].includes(field?.type) && field?.options?.maxSelect != 1) {
+        if (["select", "relation", "file"].includes(field?.type) || field?.options?.maxSelect != 1) {
             return "[]";
         }

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1140:16
             return "[]";
         }
 
-        return '""';
+        return "";
     }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1149:39
      * @param  {String} fallback Fallback url that will be used if the extractions fail.
      * @return {String}
      */
-    static getApiExampleUrl(fallback) {
-        let url = window.location.href.substring(0, window.location.href.indexOf("/_")) || fallback || '/';
-
-        // for broader compatibility replace localhost with 127.0.0.1
-        // (see https://github.com/pocketbase/js-sdk/issues/21)
-        return url.replace('//localhost', '//127.0.0.1');
-    }
+    static getApiExampleUrl(fallback) {}
 
     /**

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1150:19
      * @return {String}
      */
     static getApiExampleUrl(fallback) {
-        let url = window.location.href.substring(0, window.location.href.indexOf("/_")) || fallback || '/';
+        let url = (window.location.href.substring(0, window.location.href.indexOf("/_")) || fallback) && '/';
 
         // for broader compatibility replace localhost with 127.0.0.1

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1150:19
      * @return {String}
      */
     static getApiExampleUrl(fallback) {
-        let url = window.location.href.substring(0, window.location.href.indexOf("/_")) || fallback || '/';
+        let url = false;
 
         // for broader compatibility replace localhost with 127.0.0.1

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1165:83
      * @param  {Boolean}    withDeleteMissing Skip missing schema fields from the newCollection.
      * @return {Boolean}
      */
-    static hasCollectionChanges(oldCollection, newCollection, withDeleteMissing = false) {
+    static hasCollectionChanges(oldCollection, newCollection, withDeleteMissing = true) {
         oldCollection = oldCollection || {};
         newCollection = newCollection || {};

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1166:25
      * @return {Boolean}
      */
     static hasCollectionChanges(oldCollection, newCollection, withDeleteMissing = false) {
-        oldCollection = oldCollection || {};
+        oldCollection = true;
         newCollection = newCollection || {};
 

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1166:25
      * @return {Boolean}
      */
     static hasCollectionChanges(oldCollection, newCollection, withDeleteMissing = false) {
-        oldCollection = oldCollection || {};
+        oldCollection = false;
         newCollection = newCollection || {};
 

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1167:25
      */
     static hasCollectionChanges(oldCollection, newCollection, withDeleteMissing = false) {
         oldCollection = oldCollection || {};
-        newCollection = newCollection || {};
+        newCollection = false;
 
         if (oldCollection.id != newCollection.id) {

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1167:25
      */
     static hasCollectionChanges(oldCollection, newCollection, withDeleteMissing = false) {
         oldCollection = oldCollection || {};
-        newCollection = newCollection || {};
+        newCollection = newCollection && {};
 
         if (oldCollection.id != newCollection.id) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1169:51
         oldCollection = oldCollection || {};
         newCollection = newCollection || {};
 
-        if (oldCollection.id != newCollection.id) {
-            return true;
-        }
+        if (oldCollection.id != newCollection.id) {}
 
         for (let prop in oldCollection) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1169:13
         oldCollection = oldCollection || {};
         newCollection = newCollection || {};
 
-        if (oldCollection.id != newCollection.id) {
+        if (true) {
             return true;
         }

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1170:20
         newCollection = newCollection || {};
 
         if (oldCollection.id != newCollection.id) {
-            return true;
+            return false;
         }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1173:41
             return true;
         }
 
-        for (let prop in oldCollection) {
-            if (prop !== 'schema' && JSON.stringify(oldCollection[prop]) !== JSON.stringify(newCollection[prop])) {
-                return true;
-            }
-        }
+        for (let prop in oldCollection) {}
 
         const oldSchema = Array.isArray(oldCollection.schema) ? oldCollection.schema : [];

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1174:17
         }
 
         for (let prop in oldCollection) {
-            if (prop !== 'schema' && JSON.stringify(oldCollection[prop]) !== JSON.stringify(newCollection[prop])) {
+            if (prop !== 'schema' || JSON.stringify(oldCollection[prop]) !== JSON.stringify(newCollection[prop])) {
                 return true;
             }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1174:17
         }
 
         for (let prop in oldCollection) {
-            if (prop !== 'schema' && JSON.stringify(oldCollection[prop]) !== JSON.stringify(newCollection[prop])) {
+            if (false) {
                 return true;
             }

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1175:24
 
         for (let prop in oldCollection) {
             if (prop !== 'schema' && JSON.stringify(oldCollection[prop]) !== JSON.stringify(newCollection[prop])) {
-                return true;
+                return false;
             }
         }

[NoCoverage] ArrayDeclaration
src/utils/CommonHelper.js:1179:88
             }
         }
 
-        const oldSchema = Array.isArray(oldCollection.schema) ? oldCollection.schema : [];
+        const oldSchema = Array.isArray(oldCollection.schema) ? oldCollection.schema : ["Stryker was here"];
         const newSchema = Array.isArray(newCollection.schema) ? newCollection.schema : [];
         const removedFields = oldSchema.filter((oldField) => {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1181:62
 
         const oldSchema = Array.isArray(oldCollection.schema) ? oldCollection.schema : [];
         const newSchema = Array.isArray(newCollection.schema) ? newCollection.schema : [];
-        const removedFields = oldSchema.filter((oldField) => {
-            return oldField?.id && !CommonHelper.findByKey(newSchema, "id", oldField.id);
-        });
+        const removedFields = oldSchema.filter((oldField) => {});
         const addedFields = newSchema.filter((newField) => {
             return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:1181:31
 
         const oldSchema = Array.isArray(oldCollection.schema) ? oldCollection.schema : [];
         const newSchema = Array.isArray(newCollection.schema) ? newCollection.schema : [];
-        const removedFields = oldSchema.filter((oldField) => {
-            return oldField?.id && !CommonHelper.findByKey(newSchema, "id", oldField.id);
-        });
+        const removedFields = oldSchema;
         const addedFields = newSchema.filter((newField) => {
             return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:1182:20
         const oldSchema = Array.isArray(oldCollection.schema) ? oldCollection.schema : [];
         const newSchema = Array.isArray(newCollection.schema) ? newCollection.schema : [];
         const removedFields = oldSchema.filter((oldField) => {
-            return oldField?.id && !CommonHelper.findByKey(newSchema, "id", oldField.id);
+            return oldField.id && !CommonHelper.findByKey(newSchema, "id", oldField.id);
         });
         const addedFields = newSchema.filter((newField) => {

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1182:36
         const oldSchema = Array.isArray(oldCollection.schema) ? oldCollection.schema : [];
         const newSchema = Array.isArray(newCollection.schema) ? newCollection.schema : [];
         const removedFields = oldSchema.filter((oldField) => {
-            return oldField?.id && !CommonHelper.findByKey(newSchema, "id", oldField.id);
+            return oldField?.id && CommonHelper.findByKey(newSchema, "id", oldField.id);
         });
         const addedFields = newSchema.filter((newField) => {

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:1184:29
         const removedFields = oldSchema.filter((oldField) => {
             return oldField?.id && !CommonHelper.findByKey(newSchema, "id", oldField.id);
         });
-        const addedFields = newSchema.filter((newField) => {
-            return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);
-        });
+        const addedFields = newSchema;
         const changedFields = newSchema.filter((newField) => {
             const oldField = CommonHelper.isObject(newField) && CommonHelper.findByKey(oldSchema, "id", newField.id);

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1184:60
         const removedFields = oldSchema.filter((oldField) => {
             return oldField?.id && !CommonHelper.findByKey(newSchema, "id", oldField.id);
         });
-        const addedFields = newSchema.filter((newField) => {
-            return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);
-        });
+        const addedFields = newSchema.filter((newField) => {});
         const changedFields = newSchema.filter((newField) => {
             const oldField = CommonHelper.isObject(newField) && CommonHelper.findByKey(oldSchema, "id", newField.id);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1185:20
             return oldField?.id && !CommonHelper.findByKey(newSchema, "id", oldField.id);
         });
         const addedFields = newSchema.filter((newField) => {
-            return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);
+            return false;
         });
         const changedFields = newSchema.filter((newField) => {

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:1185:20
             return oldField?.id && !CommonHelper.findByKey(newSchema, "id", oldField.id);
         });
         const addedFields = newSchema.filter((newField) => {
-            return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);
+            return newField.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);
         });
         const changedFields = newSchema.filter((newField) => {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1187:62
         const addedFields = newSchema.filter((newField) => {
             return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);
         });
-        const changedFields = newSchema.filter((newField) => {
-            const oldField = CommonHelper.isObject(newField) && CommonHelper.findByKey(oldSchema, "id", newField.id);
-            if (!oldField) {
-                return false;
-            }
-
-            for (let prop in oldField) {
-                if (JSON.stringify(newField[prop]) != JSON.stringify(oldField[prop])) {
-                    return true;
-                }
-            }
-
-            return false;
-        });
+        const changedFields = newSchema.filter((newField) => {});
 
         return !!(

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:1187:31
         const addedFields = newSchema.filter((newField) => {
             return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);
         });
-        const changedFields = newSchema.filter((newField) => {
-            const oldField = CommonHelper.isObject(newField) && CommonHelper.findByKey(oldSchema, "id", newField.id);
-            if (!oldField) {
-                return false;
-            }
-
-            for (let prop in oldField) {
-                if (JSON.stringify(newField[prop]) != JSON.stringify(oldField[prop])) {
-                    return true;
-                }
-            }
-
-            return false;
-        });
+        const changedFields = newSchema;
 
         return !!(
