[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1188:30
             return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);
         });
         const changedFields = newSchema.filter((newField) => {
-            const oldField = CommonHelper.isObject(newField) && CommonHelper.findByKey(oldSchema, "id", newField.id);
+            const oldField = false;
             if (!oldField) {
                 return false;

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1188:30
             return newField?.id && !CommonHelper.findByKey(oldSchema, "id", newField.id);
         });
         const changedFields = newSchema.filter((newField) => {
-            const oldField = CommonHelper.isObject(newField) && CommonHelper.findByKey(oldSchema, "id", newField.id);
+            const oldField = CommonHelper.isObject(newField) || CommonHelper.findByKey(oldSchema, "id", newField.id);
             if (!oldField) {
                 return false;

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1189:28
         });
         const changedFields = newSchema.filter((newField) => {
             const oldField = CommonHelper.isObject(newField) && CommonHelper.findByKey(oldSchema, "id", newField.id);
-            if (!oldField) {
-                return false;
-            }
+            if (!oldField) {}
 
             for (let prop in oldField) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1189:17
         });
         const changedFields = newSchema.filter((newField) => {
             const oldField = CommonHelper.isObject(newField) && CommonHelper.findByKey(oldSchema, "id", newField.id);
-            if (!oldField) {
+            if (true) {
                 return false;
             }

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1190:24
         const changedFields = newSchema.filter((newField) => {
             const oldField = CommonHelper.isObject(newField) && CommonHelper.findByKey(oldSchema, "id", newField.id);
             if (!oldField) {
-                return false;
+                return true;
             }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1193:40
                 return false;
             }
 
-            for (let prop in oldField) {
-                if (JSON.stringify(newField[prop]) != JSON.stringify(oldField[prop])) {
-                    return true;
-                }
-            }
+            for (let prop in oldField) {}
 
             return false;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1194:21
             }
 
             for (let prop in oldField) {
-                if (JSON.stringify(newField[prop]) != JSON.stringify(oldField[prop])) {
+                if (false) {
                     return true;
                 }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1194:87
             }
 
             for (let prop in oldField) {
-                if (JSON.stringify(newField[prop]) != JSON.stringify(oldField[prop])) {
-                    return true;
-                }
+                if (JSON.stringify(newField[prop]) != JSON.stringify(oldField[prop])) {}
             }
 

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1195:28
 
             for (let prop in oldField) {
                 if (JSON.stringify(newField[prop]) != JSON.stringify(oldField[prop])) {
-                    return true;
+                    return false;
                 }
             }

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1202:17
             return false;
         });
 
-        return !!(
-            addedFields.length ||
-            changedFields.length ||
-            (withDeleteMissing && removedFields.length)
-        );
+        return !addedFields.length || changedFields.length || withDeleteMissing && removedFields.length;
     }
 

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1202:16
             return false;
         });
 
-        return !!(
-            addedFields.length ||
-            changedFields.length ||
-            (withDeleteMissing && removedFields.length)
-        );
+        return !(addedFields.length || changedFields.length || withDeleteMissing && removedFields.length);
     }
 

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1203:13
         });
 
         return !!(
-            addedFields.length ||
-            changedFields.length ||
+            addedFields.length && changedFields.length ||
             (withDeleteMissing && removedFields.length)
         );

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1203:13
         });
 
         return !!(
-            addedFields.length ||
-            changedFields.length ||
-            (withDeleteMissing && removedFields.length)
+            false
         );
     }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1205:14
         return !!(
             addedFields.length ||
             changedFields.length ||
-            (withDeleteMissing && removedFields.length)
+            (false)
         );
     }

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1205:14
         return !!(
             addedFields.length ||
             changedFields.length ||
-            (withDeleteMissing && removedFields.length)
+            (withDeleteMissing || removedFields.length)
         );
     }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1215:46
      * @param  {Array} collections
      * @return {Array}
      */
-    static sortCollections(collections = []) {
-        const auth = [];
-        const base = [];
-        const view = [];
-
-        for (const collection of collections) {
-            if (collection.type === 'auth') {
-                auth.push(collection);
-            } else if (collection.type === 'base') {
-                base.push(collection);
-            } else {
-                view.push(collection);
-            }
-        }
-
-        return [].concat(auth, base, view);
-    }
+    static sortCollections(collections = []) {}
 
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1220:47
         const base = [];
         const view = [];
 
-        for (const collection of collections) {
-            if (collection.type === 'auth') {
-                auth.push(collection);
-            } else if (collection.type === 'base') {
-                base.push(collection);
-            } else {
-                view.push(collection);
-            }
-        }
+        for (const collection of collections) {}
 
         return [].concat(auth, base, view);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1221:17
         const view = [];
 
         for (const collection of collections) {
-            if (collection.type === 'auth') {
+            if (false) {
                 auth.push(collection);
             } else if (collection.type === 'base') {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1221:17
         const view = [];
 
         for (const collection of collections) {
-            if (collection.type === 'auth') {
+            if (true) {
                 auth.push(collection);
             } else if (collection.type === 'base') {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1223:24
         for (const collection of collections) {
             if (collection.type === 'auth') {
                 auth.push(collection);
-            } else if (collection.type === 'base') {
+            } else if (true) {
                 base.push(collection);
             } else {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1223:24
         for (const collection of collections) {
             if (collection.type === 'auth') {
                 auth.push(collection);
-            } else if (collection.type === 'base') {
+            } else if (false) {
                 base.push(collection);
             } else {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1225:20
                 auth.push(collection);
             } else if (collection.type === 'base') {
                 base.push(collection);
-            } else {
-                view.push(collection);
-            }
+            } else {}
         }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1239:26
      *
      * (see https://web.dev/optimize-long-tasks/)
      */
-    static yieldToMain() {
-        return new Promise((resolve) => {
-            setTimeout(resolve, 0);
-        });
-    }
+    static yieldToMain() {}
 
     /**

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1240:41
      * (see https://web.dev/optimize-long-tasks/)
      */
     static yieldToMain() {
-        return new Promise((resolve) => {
-            setTimeout(resolve, 0);
-        });
+        return new Promise((resolve) => {});
     }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1250:38
      *
      * @return {Object}
      */
-    static defaultFlatpickrOptions() {
-        return {
-            dateFormat: "Y-m-d H:i:S",
-            disableMobile: true,
-            allowInput: true,
-            enableTime: true,
-            time_24hr: true,
-            locale: {
-                firstDayOfWeek: 1,
-            },
-        }
-    }
+    static defaultFlatpickrOptions() {}
 
     /**

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1252:25
      */
     static defaultFlatpickrOptions() {
         return {
-            dateFormat: "Y-m-d H:i:S",
+            dateFormat: "",
             disableMobile: true,
             allowInput: true,

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1253:28
     static defaultFlatpickrOptions() {
         return {
             dateFormat: "Y-m-d H:i:S",
-            disableMobile: true,
+            disableMobile: false,
             allowInput: true,
             enableTime: true,

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1254:25
         return {
             dateFormat: "Y-m-d H:i:S",
             disableMobile: true,
-            allowInput: true,
+            allowInput: false,
             enableTime: true,
             time_24hr: true,

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1255:25
             dateFormat: "Y-m-d H:i:S",
             disableMobile: true,
             allowInput: true,
-            enableTime: true,
+            enableTime: false,
             time_24hr: true,
             locale: {

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1256:24
             disableMobile: true,
             allowInput: true,
             enableTime: true,
-            time_24hr: true,
+            time_24hr: false,
             locale: {
                 firstDayOfWeek: 1,

[NoCoverage] ObjectLiteral
src/utils/CommonHelper.js:1257:21
             allowInput: true,
             enableTime: true,
             time_24hr: true,
-            locale: {
-                firstDayOfWeek: 1,
-            },
+            locale: {},
         }
     }

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1270:23
      */
     static defaultEditorOptions() {
         return {
-            branding: false,
+            branding: true,
             promotion: false,
             menubar: false,

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1271:24
     static defaultEditorOptions() {
         return {
             branding: false,
-            promotion: false,
+            promotion: true,
             menubar: false,
             min_height: 270,

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1272:22
         return {
             branding: false,
             promotion: false,
-            menubar: false,
+            menubar: true,
             min_height: 270,
             height: 270,

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1280:17
             skin: "pocketbase",
             content_style: "body { font-size: 14px }",
             plugins: [
-                "autoresize",
+                "",
                 "autolink",
                 "lists",

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1284:17
                 "autolink",
                 "lists",
                 "link",
-                "image",
+                "",
                 "searchreplace",
                 "fullscreen",

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1290:17
                 "media",
                 "table",
                 "code",
-                "codesample",
+                "",
             ],
             toolbar:

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1293:17
                 "codesample",
             ],
             toolbar:
-                "undo redo | styles | alignleft aligncenter alignright | bold italic forecolor backcolor | bullist numlist | link image table codesample | code fullscreen",
+                "",
             file_picker_types: "image",
             // @see https://www.tiny.cloud/docs/tinymce/6/file-image-upload/#interactive-example

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1294:32
             ],
             toolbar:
                 "undo redo | styles | alignleft aligncenter alignright | bold italic forecolor backcolor | bullist numlist | link image table codesample | code fullscreen",
-            file_picker_types: "image",
+            file_picker_types: "",
             // @see https://www.tiny.cloud/docs/tinymce/6/file-image-upload/#interactive-example
             file_picker_callback: (cb, value, meta) => {

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1297:54
             file_picker_types: "image",
             // @see https://www.tiny.cloud/docs/tinymce/6/file-image-upload/#interactive-example
             file_picker_callback: (cb, value, meta) => {
-                const input = document.createElement("input");
+                const input = document.createElement("");
                 input.setAttribute("type", "file");
                 input.setAttribute("accept", "image/*");

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1298:44
             // @see https://www.tiny.cloud/docs/tinymce/6/file-image-upload/#interactive-example
             file_picker_callback: (cb, value, meta) => {
                 const input = document.createElement("input");
-                input.setAttribute("type", "file");
+                input.setAttribute("type", "");
                 input.setAttribute("accept", "image/*");
 

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1298:36
             // @see https://www.tiny.cloud/docs/tinymce/6/file-image-upload/#interactive-example
             file_picker_callback: (cb, value, meta) => {
                 const input = document.createElement("input");
-                input.setAttribute("type", "file");
+                input.setAttribute("", "file");
                 input.setAttribute("accept", "image/*");
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1301:57
                 input.setAttribute("type", "file");
                 input.setAttribute("accept", "image/*");
 
-                input.addEventListener("change", (e) => {
-                    const file = e.target.files[0];
-                    const reader = new FileReader();
-
-                    reader.addEventListener("load", () => {
-                        if (!tinymce) {
-                            return;
-                        }
-
-                        // We need to register the blob in TinyMCEs image blob registry.
-                        // In future TinyMCE version this part will be handled internally.
-                        const id = "blobid" + new Date().getTime();
-                        const blobCache = tinymce.activeEditor.editorUpload.blobCache;
-                        const base64 = reader.result.split(",")[1];
-                        const blobInfo = blobCache.create(id, file, base64);
-                        blobCache.add(blobInfo);
-
-                        // call the callback and populate the Title field with the file name
-                        cb(blobInfo.blobUri(), { title: file.name });
-                    });
-
-                    reader.readAsDataURL(file);
-                });
+                input.addEventListener("change", (e) => {});
 
                 input.click();

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1305:59
                     const file = e.target.files[0];
                     const reader = new FileReader();
 
-                    reader.addEventListener("load", () => {
-                        if (!tinymce) {
-                            return;
-                        }
-
-                        // We need to register the blob in TinyMCEs image blob registry.
-                        // In future TinyMCE version this part will be handled internally.
-                        const id = "blobid" + new Date().getTime();
-                        const blobCache = tinymce.activeEditor.editorUpload.blobCache;
-                        const base64 = reader.result.split(",")[1];
-                        const blobInfo = blobCache.create(id, file, base64);
-                        blobCache.add(blobInfo);
-
-                        // call the callback and populate the Title field with the file name
-                        cb(blobInfo.blobUri(), { title: file.name });
-                    });
+                    reader.addEventListener("load", () => {});
 
                     reader.readAsDataURL(file);

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1306:39
                     const reader = new FileReader();
 
                     reader.addEventListener("load", () => {
-                        if (!tinymce) {
-                            return;
-                        }
+                        if (!tinymce) {}
 
                         // We need to register the blob in TinyMCEs image blob registry.

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1306:29
                     const reader = new FileReader();
 
                     reader.addEventListener("load", () => {
-                        if (!tinymce) {
+                        if (true) {
                             return;
                         }

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1312:36
 
                         // We need to register the blob in TinyMCEs image blob registry.
                         // In future TinyMCE version this part will be handled internally.
-                        const id = "blobid" + new Date().getTime();
+                        const id = "" + new Date().getTime();
                         const blobCache = tinymce.activeEditor.editorUpload.blobCache;
                         const base64 = reader.result.split(",")[1];

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1314:60
                         // In future TinyMCE version this part will be handled internally.
                         const id = "blobid" + new Date().getTime();
                         const blobCache = tinymce.activeEditor.editorUpload.blobCache;
-                        const base64 = reader.result.split(",")[1];
+                        const base64 = reader.result.split("")[1];
                         const blobInfo = blobCache.create(id, file, base64);
                         blobCache.add(blobInfo);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1337:17
      * @return {Any}
      */
     static displayValue(model, displayFields, missingValue = "N/A") {
-        model = model || {};
+        model = false;
         displayFields = displayFields || [];
 

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1337:17
      * @return {Any}
      */
     static displayValue(model, displayFields, missingValue = "N/A") {
-        model = model || {};
+        model = true;
         displayFields = displayFields || [];
 

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1338:25
      */
     static displayValue(model, displayFields, missingValue = "N/A") {
         model = model || {};
-        displayFields = displayFields || [];
+        displayFields = displayFields && [];
 
         let result = [];

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1338:25
      */
     static displayValue(model, displayFields, missingValue = "N/A") {
         model = model || {};
-        displayFields = displayFields || [];
+        displayFields = true;
 
         let result = [];

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1342:44
 
         let result = [];
 
-        for (const field of displayFields) {
-            let val = model[field];
-
-            if (typeof val === "undefined") {
-                continue
-            }
-
-            if (CommonHelper.isEmpty(val)) {
-                result.push(missingValue);
-            } else if (typeof val === "boolean")  {
-                result.push(val ? "True" : "False");
-            } else if (typeof val === "string") {
-                val = val.indexOf("<") >= 0 ? CommonHelper.plainText(val) : val;
-                result.push(CommonHelper.truncate(val));
-            } else {
-                result.push(val);
-            }
-        }
+        for (const field of displayFields) {}
 
         if (result.length > 0) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1345:45
         for (const field of displayFields) {
             let val = model[field];
 
-            if (typeof val === "undefined") {
-                continue
-            }
+            if (typeof val === "undefined") {}
 
             if (CommonHelper.isEmpty(val)) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1345:17
         for (const field of displayFields) {
             let val = model[field];
 
-            if (typeof val === "undefined") {
+            if (true) {
                 continue
             }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1349:44
                 continue
             }
 
-            if (CommonHelper.isEmpty(val)) {
-                result.push(missingValue);
-            } else if (typeof val === "boolean")  {
+            if (CommonHelper.isEmpty(val)) {} else if (typeof val === "boolean")  {
                 result.push(val ? "True" : "False");
             } else if (typeof val === "string") {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1349:17
                 continue
             }
 
-            if (CommonHelper.isEmpty(val)) {
+            if (false) {
                 result.push(missingValue);
             } else if (typeof val === "boolean")  {

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:1351:24
 
             if (CommonHelper.isEmpty(val)) {
                 result.push(missingValue);
-            } else if (typeof val === "boolean")  {
+            } else if (typeof val !== "boolean")  {
                 result.push(val ? "True" : "False");
             } else if (typeof val === "string") {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1351:24
 
             if (CommonHelper.isEmpty(val)) {
                 result.push(missingValue);
-            } else if (typeof val === "boolean")  {
+            } else if (true)  {
                 result.push(val ? "True" : "False");
             } else if (typeof val === "string") {

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1352:44
             if (CommonHelper.isEmpty(val)) {
                 result.push(missingValue);
             } else if (typeof val === "boolean")  {
-                result.push(val ? "True" : "False");
+                result.push(val ? "True" : "");
             } else if (typeof val === "string") {
                 val = val.indexOf("<") >= 0 ? CommonHelper.plainText(val) : val;

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1352:35
             if (CommonHelper.isEmpty(val)) {
                 result.push(missingValue);
             } else if (typeof val === "boolean")  {
-                result.push(val ? "True" : "False");
+                result.push(val ? "" : "False");
             } else if (typeof val === "string") {
                 val = val.indexOf("<") >= 0 ? CommonHelper.plainText(val) : val;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1353:24
                 result.push(missingValue);
             } else if (typeof val === "boolean")  {
                 result.push(val ? "True" : "False");
-            } else if (typeof val === "string") {
+            } else if (true) {
                 val = val.indexOf("<") >= 0 ? CommonHelper.plainText(val) : val;
                 result.push(CommonHelper.truncate(val));

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:1353:24
                 result.push(missingValue);
             } else if (typeof val === "boolean")  {
                 result.push(val ? "True" : "False");
-            } else if (typeof val === "string") {
+            } else if (typeof val !== "string") {
                 val = val.indexOf("<") >= 0 ? CommonHelper.plainText(val) : val;
                 result.push(CommonHelper.truncate(val));

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:1354:23
             } else if (typeof val === "boolean")  {
                 result.push(val ? "True" : "False");
             } else if (typeof val === "string") {
-                val = val.indexOf("<") >= 0 ? CommonHelper.plainText(val) : val;
+                val = val.indexOf("<") > 0 ? CommonHelper.plainText(val) : val;
                 result.push(CommonHelper.truncate(val));
             } else {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1354:23
             } else if (typeof val === "boolean")  {
                 result.push(val ? "True" : "False");
             } else if (typeof val === "string") {
-                val = val.indexOf("<") >= 0 ? CommonHelper.plainText(val) : val;
+                val = true ? CommonHelper.plainText(val) : val;
                 result.push(CommonHelper.truncate(val));
             } else {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1356:20
             } else if (typeof val === "string") {
                 val = val.indexOf("<") >= 0 ? CommonHelper.plainText(val) : val;
                 result.push(CommonHelper.truncate(val));
-            } else {
-                result.push(val);
-            }
+            } else {}
         }
 

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:1361:13
             }
         }
 
-        if (result.length > 0) {
+        if (result.length <= 0) {
             return result.join(", ");
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1361:13
             }
         }
 
-        if (result.length > 0) {
+        if (false) {
             return result.join(", ");
         }

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1368:13
         const fallbackProps = [
             "title",
             "name",
-            "email",
+            "",
             "username",
             "heading",

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1369:13
             "title",
             "name",
             "email",
-            "username",
+            "",
             "heading",
             "label",

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1370:13
             "name",
             "email",
             "username",
-            "heading",
+            "",
             "label",
             "key",

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1373:13
             "heading",
             "label",
             "key",
-            "id",
+            "",
         ];
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1376:43
             "id",
         ];
 
-        for (const prop of fallbackProps) {
-            if (!CommonHelper.isEmpty(model[prop])) {
-                return model[prop];
-            }
-        }
+        for (const prop of fallbackProps) {}
 
         return missingValue;

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1377:17
         ];
 
         for (const prop of fallbackProps) {
-            if (!CommonHelper.isEmpty(model[prop])) {
+            if (CommonHelper.isEmpty(model[prop])) {
                 return model[prop];
             }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1377:17
         ];
 
         for (const prop of fallbackProps) {
-            if (!CommonHelper.isEmpty(model[prop])) {
+            if (false) {
                 return model[prop];
             }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1393:49
      * @param  {String} selectQuery
      * @return {Array}
      */
-    static extractColumnsFromQuery(selectQuery) {
-        const groupReplacement = "__GROUP__";
-
-        selectQuery = (selectQuery || "").
-            // replace parenthesis/group expessions
-            replace(/\([\s\S]+?\)/gm, groupReplacement).
-            // replace multi-whitespace characters with single space
-            replace(/[\t\r\n]|(?:\s\s)+/g, " ");
-
-        const match = selectQuery.match(/select\s+([\s\S]+)\s+from/);
-
-        const expressions = match?.[1]?.split(",") || [];
-
-        const result = [];
-
-        for (let expr of expressions) {
-            const column = expr.trim().split(" ").pop(); // get only the alias
-            if (column != "" && column != groupReplacement) {
-                result.push(column.replace(/[\'\"\`\[\]\s]/g, ""));
-            }
-        }
-
-        return result;
-    }
+    static extractColumnsFromQuery(selectQuery) {}
 
     /**

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1394:34
      * @return {Array}
      */
     static extractColumnsFromQuery(selectQuery) {
-        const groupReplacement = "__GROUP__";
+        const groupReplacement = "";
 
         selectQuery = (selectQuery || "").
