[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1396:24
     static extractColumnsFromQuery(selectQuery) {
         const groupReplacement = "__GROUP__";
 
-        selectQuery = (selectQuery || "").
+        selectQuery = (selectQuery && "").
             // replace parenthesis/group expessions
             replace(/\([\s\S]+?\)/gm, groupReplacement).

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1396:24
     static extractColumnsFromQuery(selectQuery) {
         const groupReplacement = "__GROUP__";
 
-        selectQuery = (selectQuery || "").
+        selectQuery = (false).
             // replace parenthesis/group expessions
             replace(/\([\s\S]+?\)/gm, groupReplacement).

[NoCoverage] Regex
src/utils/CommonHelper.js:1398:21
 
         selectQuery = (selectQuery || "").
             // replace parenthesis/group expessions
-            replace(/\([\s\S]+?\)/gm, groupReplacement).
+            replace(/\([^\s\S]+?\)/gm, groupReplacement).
             // replace multi-whitespace characters with single space
             replace(/[\t\r\n]|(?:\s\s)+/g, " ");

[NoCoverage] Regex
src/utils/CommonHelper.js:1398:21
 
         selectQuery = (selectQuery || "").
             // replace parenthesis/group expessions
-            replace(/\([\s\S]+?\)/gm, groupReplacement).
+            replace(/\([\S\S]+?\)/gm, groupReplacement).
             // replace multi-whitespace characters with single space
             replace(/[\t\r\n]|(?:\s\s)+/g, " ");

[NoCoverage] Regex
src/utils/CommonHelper.js:1400:21
             // replace parenthesis/group expessions
             replace(/\([\s\S]+?\)/gm, groupReplacement).
             // replace multi-whitespace characters with single space
-            replace(/[\t\r\n]|(?:\s\s)+/g, " ");
+            replace(/[\t\r\n]|(?:\s\s)/g, " ");
 
         const match = selectQuery.match(/select\s+([\s\S]+)\s+from/);

[NoCoverage] Regex
src/utils/CommonHelper.js:1402:41
             // replace multi-whitespace characters with single space
             replace(/[\t\r\n]|(?:\s\s)+/g, " ");
 
-        const match = selectQuery.match(/select\s+([\s\S]+)\s+from/);
+        const match = selectQuery.match(/select\s+([\s\S])\s+from/);
 
         const expressions = match?.[1]?.split(",") || [];

[NoCoverage] Regex
src/utils/CommonHelper.js:1402:41
             // replace multi-whitespace characters with single space
             replace(/[\t\r\n]|(?:\s\s)+/g, " ");
 
-        const match = selectQuery.match(/select\s+([\s\S]+)\s+from/);
+        const match = selectQuery.match(/select\S+([\s\S]+)\s+from/);
 
         const expressions = match?.[1]?.split(",") || [];

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1404:29
 
         const match = selectQuery.match(/select\s+([\s\S]+)\s+from/);
 
-        const expressions = match?.[1]?.split(",") || [];
+        const expressions = true;
 
         const result = [];

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:1404:29
 
         const match = selectQuery.match(/select\s+([\s\S]+)\s+from/);
 
-        const expressions = match?.[1]?.split(",") || [];
+        const expressions = match[1]?.split(",") || [];
 
         const result = [];

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1408:39
 
         const result = [];
 
-        for (let expr of expressions) {
-            const column = expr.trim().split(" ").pop(); // get only the alias
-            if (column != "" && column != groupReplacement) {
-                result.push(column.replace(/[\'\"\`\[\]\s]/g, ""));
-            }
-        }
+        for (let expr of expressions) {}
 
         return result;

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:1409:28
         const result = [];
 
         for (let expr of expressions) {
-            const column = expr.trim().split(" ").pop(); // get only the alias
+            const column = expr.split(" ").pop(); // get only the alias
             if (column != "" && column != groupReplacement) {
                 result.push(column.replace(/[\'\"\`\[\]\s]/g, ""));

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1410:17
 
         for (let expr of expressions) {
             const column = expr.trim().split(" ").pop(); // get only the alias
-            if (column != "" && column != groupReplacement) {
+            if (true) {
                 result.push(column.replace(/[\'\"\`\[\]\s]/g, ""));
             }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1410:17
 
         for (let expr of expressions) {
             const column = expr.trim().split(" ").pop(); // get only the alias
-            if (column != "" && column != groupReplacement) {
+            if (true && column != groupReplacement) {
                 result.push(column.replace(/[\'\"\`\[\]\s]/g, ""));
             }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1426:26
      * @return {Array}
      */
     static getAllCollectionIdentifiers(collection, prefix = "") {
-        if (!collection) {
-            return;
-        }
+        if (!collection) {}
 
         let result = [prefix + "id"];

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1426:13
      * @return {Array}
      */
     static getAllCollectionIdentifiers(collection, prefix = "") {
-        if (!collection) {
+        if (true) {
             return;
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1432:33
 
         let result = [prefix + "id"];
 
-        if (collection.$isView) {
-            for (let col of CommonHelper.extractColumnsFromQuery(collection.options.query)) {
-                CommonHelper.pushUnique(result, prefix + col);
-            }
-        } else if (collection.$isAuth) {
+        if (collection.$isView) {} else if (collection.$isAuth) {
             result.push(prefix + "username");
             result.push(prefix + "email");

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1432:13
 
         let result = [prefix + "id"];
 
-        if (collection.$isView) {
+        if (true) {
             for (let col of CommonHelper.extractColumnsFromQuery(collection.options.query)) {
                 CommonHelper.pushUnique(result, prefix + col);

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1433:93
         let result = [prefix + "id"];
 
         if (collection.$isView) {
-            for (let col of CommonHelper.extractColumnsFromQuery(collection.options.query)) {
-                CommonHelper.pushUnique(result, prefix + col);
-            }
+            for (let col of CommonHelper.extractColumnsFromQuery(collection.options.query)) {}
         } else if (collection.$isAuth) {
             result.push(prefix + "username");

[NoCoverage] ArithmeticOperator
src/utils/CommonHelper.js:1434:49
 
         if (collection.$isView) {
             for (let col of CommonHelper.extractColumnsFromQuery(collection.options.query)) {
-                CommonHelper.pushUnique(result, prefix + col);
+                CommonHelper.pushUnique(result, prefix - col);
             }
         } else if (collection.$isAuth) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1436:20
             for (let col of CommonHelper.extractColumnsFromQuery(collection.options.query)) {
                 CommonHelper.pushUnique(result, prefix + col);
             }
-        } else if (collection.$isAuth) {
+        } else if (true) {
             result.push(prefix + "username");
             result.push(prefix + "email");

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1436:40
             for (let col of CommonHelper.extractColumnsFromQuery(collection.options.query)) {
                 CommonHelper.pushUnique(result, prefix + col);
             }
-        } else if (collection.$isAuth) {
-            result.push(prefix + "username");
-            result.push(prefix + "email");
-            result.push(prefix + "emailVisibility");
-            result.push(prefix + "verified");
-            result.push(prefix + "created");
-            result.push(prefix + "updated");
-        } else {
+        } else if (collection.$isAuth) {} else {
             result.push(prefix + "created");
             result.push(prefix + "updated");

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1438:34
             }
         } else if (collection.$isAuth) {
             result.push(prefix + "username");
-            result.push(prefix + "email");
+            result.push(prefix + "");
             result.push(prefix + "emailVisibility");
             result.push(prefix + "verified");

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1441:34
             result.push(prefix + "email");
             result.push(prefix + "emailVisibility");
             result.push(prefix + "verified");
-            result.push(prefix + "created");
+            result.push(prefix + "");
             result.push(prefix + "updated");
         } else {

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1442:34
             result.push(prefix + "emailVisibility");
             result.push(prefix + "verified");
             result.push(prefix + "created");
-            result.push(prefix + "updated");
+            result.push(prefix + "");
         } else {
             result.push(prefix + "created");

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1443:16
             result.push(prefix + "verified");
             result.push(prefix + "created");
             result.push(prefix + "updated");
-        } else {
-            result.push(prefix + "created");
-            result.push(prefix + "updated");
-        }
+        } else {}
 
         const schema = collection.schema || [];

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1444:34
             result.push(prefix + "created");
             result.push(prefix + "updated");
         } else {
-            result.push(prefix + "created");
+            result.push(prefix + "");
             result.push(prefix + "updated");
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1448:24
             result.push(prefix + "updated");
         }
 
-        const schema = collection.schema || [];
+        const schema = false;
 
         for (const field of schema) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1448:24
             result.push(prefix + "updated");
         }
 
-        const schema = collection.schema || [];
+        const schema = true;
 
         for (const field of schema) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1450:37
 
         const schema = collection.schema || [];
 
-        for (const field of schema) {
-            CommonHelper.pushUnique(result, prefix + field.name);
-        }
+        for (const field of schema) {}
 
         return result;

[NoCoverage] ArithmeticOperator
src/utils/CommonHelper.js:1451:45
         const schema = collection.schema || [];
 
         for (const field of schema) {
-            CommonHelper.pushUnique(result, prefix + field.name);
+            CommonHelper.pushUnique(result, prefix - field.name);
         }
 

[Killed] ObjectLiteral
src/utils/CommonHelper.js:1480:24
      * @return {{unique: boolean}}
      */
     static parseIndex(idx) {
-        const result = {
-            unique:     false,
-            optional:   false,
-            schemaName: "",
-            indexName:  "",
-            tableName:  "",
-            columns:    [],
-            where:      "",
-        };
+        const result = {};
 
         const indexRegex = /create\s+(unique\s+)?\s*index\s*(if\s+not\s+exists\s+)?(\S*)\s+on\s+(\S*)\s+\(([\s\S]*)\)(?:\s*where\s+([\s\S]*))?/gmi;
killedBy: CommonHelpers.parseIndex should not return meaningful values if the index is an empty string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "columns": Array [],
-   "indexName": "",

[Killed] BooleanLiteral
src/utils/CommonHelper.js:1481:25
      */
     static parseIndex(idx) {
         const result = {
-            unique:     false,
+            unique:     true,
             optional:   false,
             schemaName: "",
killedBy: CommonHelpers.parseIndex should not return meaningful values if the index is an empty string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,8 +2,8 @@
    "columns": Array [],
    "indexName": "",

[Killed] BooleanLiteral
src/utils/CommonHelper.js:1482:25
     static parseIndex(idx) {
         const result = {
             unique:     false,
-            optional:   false,
+            optional:   true,
             schemaName: "",
             indexName:  "",
killedBy: CommonHelpers.parseIndex should not return meaningful values if the index is an empty string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "columns": Array [],
    "indexName": "",

[Killed] StringLiteral
src/utils/CommonHelper.js:1485:25
             optional:   false,
             schemaName: "",
             indexName:  "",
-            tableName:  "",
+            tableName:  "Stryker was here!",
             columns:    [],
             where:      "",
killedBy: CommonHelpers.parseIndex should not return meaningful values if the index is an empty string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "columns": Array [],
    "indexName": "",

[Killed] Regex
src/utils/CommonHelper.js:1490:28
             where:      "",
         };
 
-        const indexRegex = /create\s+(unique\s+)?\s*index\s*(if\s+not\s+exists\s+)?(\S*)\s+on\s+(\S*)\s+\(([\s\S]*)\)(?:\s*where\s+([\s\S]*))?/gmi;
+        const indexRegex = /create\s+(unique\s+)\s*index\s*(if\s+not\s+exists\s+)?(\S*)\s+on\s+(\S*)\s+\(([\s\S]*)\)(?:\s*where\s+([\s\S]*))?/gmi;
         const matches    = indexRegex.exec((idx || "").trim())
 
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "index_name"
Received: ""

[Killed] Regex
src/utils/CommonHelper.js:1490:28
             where:      "",
         };
 
-        const indexRegex = /create\s+(unique\s+)?\s*index\s*(if\s+not\s+exists\s+)?(\S*)\s+on\s+(\S*)\s+\(([\s\S]*)\)(?:\s*where\s+([\s\S]*))?/gmi;
+        const indexRegex = /create\s+(unique\s+)?\s*index\s*(if\s+not\s+exists\s+)?(\S*)\s+on\s+(\S*)\s+\(([\s\S])\)(?:\s*where\s+([\s\S]*))?/gmi;
         const matches    = indexRegex.exec((idx || "").trim())
 
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "index_name"
Received: ""

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1491:45
         };
 
         const indexRegex = /create\s+(unique\s+)?\s*index\s*(if\s+not\s+exists\s+)?(\S*)\s+on\s+(\S*)\s+\(([\s\S]*)\)(?:\s*where\s+([\s\S]*))?/gmi;
-        const matches    = indexRegex.exec((idx || "").trim())
+        const matches    = indexRegex.exec((true).trim())
 
         if (matches?.length != 7) {
killedBy: CommonHelpers.parseIndex should not return meaningful values if the index is an empty string
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).trim is not a function

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1491:45
         };
 
         const indexRegex = /create\s+(unique\s+)?\s*index\s*(if\s+not\s+exists\s+)?(\S*)\s+on\s+(\S*)\s+\(([\s\S]*)\)(?:\s*where\s+([\s\S]*))?/gmi;
-        const matches    = indexRegex.exec((idx || "").trim())
+        const matches    = indexRegex.exec((false).trim())
 
         if (matches?.length != 7) {
killedBy: CommonHelpers.parseIndex should not return meaningful values if the index is an empty string
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).trim is not a function

[Killed] OptionalChaining
src/utils/CommonHelper.js:1493:13
         const indexRegex = /create\s+(unique\s+)?\s*index\s*(if\s+not\s+exists\s+)?(\S*)\s+on\s+(\S*)\s+\(([\s\S]*)\)(?:\s*where\s+([\s\S]*))?/gmi;
         const matches    = indexRegex.exec((idx || "").trim())
 
-        if (matches?.length != 7) {
+        if (matches.length != 7) {
             return result;
         }
killedBy: CommonHelpers.parseIndex should not return meaningful values if the index is an empty string
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1493:13
         const indexRegex = /create\s+(unique\s+)?\s*index\s*(if\s+not\s+exists\s+)?(\S*)\s+on\s+(\S*)\s+\(([\s\S]*)\)(?:\s*where\s+([\s\S]*))?/gmi;
         const matches    = indexRegex.exec((idx || "").trim())
 
-        if (matches?.length != 7) {
+        if (true) {
             return result;
         }
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "index_name"
Received: ""

[Killed] Regex
src/utils/CommonHelper.js:1497:31
             return result;
         }
 
-        const sqlQuoteRegex = /^[\"\'\`\[\{}]|[\"\'\`\]\}]$/gm
+        const sqlQuoteRegex = /^[^\"\'\`\[\{}]|[\"\'\`\]\}]$/gm
 
         // unique
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "index_name"
Received: "ndex_name"

[Killed] MethodExpression
src/utils/CommonHelper.js:1500:25
         const sqlQuoteRegex = /^[\"\'\`\[\{}]|[\"\'\`\]\}]$/gm
 
         // unique
-        result.unique = matches[1]?.trim().toLowerCase() === "unique";
+        result.unique = matches[1].toLowerCase() === "unique";
 
         // optional
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] EqualityOperator
src/utils/CommonHelper.js:1500:25
         const sqlQuoteRegex = /^[\"\'\`\[\{}]|[\"\'\`\]\}]$/gm
 
         // unique
-        result.unique = matches[1]?.trim().toLowerCase() === "unique";
+        result.unique = matches[1]?.trim().toLowerCase() !== "unique";
 
         // optional
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -8,8 +8,8 @@
    ],
    "indexName": "index_name",

[Killed] OptionalChaining
src/utils/CommonHelper.js:1503:49
         result.unique = matches[1]?.trim().toLowerCase() === "unique";
 
         // optional
-        result.optional = !CommonHelper.isEmpty(matches[2]?.trim());
+        result.optional = !CommonHelper.isEmpty(matches[2].trim());
 
         // schemaName and indexName
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] BooleanLiteral
src/utils/CommonHelper.js:1503:27
         result.unique = matches[1]?.trim().toLowerCase() === "unique";
 
         // optional
-        result.optional = !CommonHelper.isEmpty(matches[2]?.trim());
+        result.optional = CommonHelper.isEmpty(matches[2]?.trim());
 
         // schemaName and indexName
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,11 +5,11 @@
        "name": "column_name",
        "sort": "",

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1506:27
         result.optional = !CommonHelper.isEmpty(matches[2]?.trim());
 
         // schemaName and indexName
-        const namePair = (matches[3] || "").split(".");
+        const namePair = (false).split(".");
         if (namePair.length == 2) {
             result.schemaName = namePair[0].replace(sqlQuoteRegex, "");
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).split is not a function

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1506:27
         result.optional = !CommonHelper.isEmpty(matches[2]?.trim());
 
         // schemaName and indexName
-        const namePair = (matches[3] || "").split(".");
+        const namePair = (true).split(".");
         if (namePair.length == 2) {
             result.schemaName = namePair[0].replace(sqlQuoteRegex, "");
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).split is not a function

[Killed] EqualityOperator
src/utils/CommonHelper.js:1507:13
 
         // schemaName and indexName
         const namePair = (matches[3] || "").split(".");
-        if (namePair.length == 2) {
+        if (namePair.length != 2) {
             result.schemaName = namePair[0].replace(sqlQuoteRegex, "");
             result.indexName = namePair[1].replace(sqlQuoteRegex, "");
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1507:13
 
         // schemaName and indexName
         const namePair = (matches[3] || "").split(".");
-        if (namePair.length == 2) {
+        if (false) {
             result.schemaName = namePair[0].replace(sqlQuoteRegex, "");
             result.indexName = namePair[1].replace(sqlQuoteRegex, "");
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -4,12 +4,12 @@
        "collate": "",
        "name": "column_name",

[Survived] StringLiteral
src/utils/CommonHelper.js:1509:67
         const namePair = (matches[3] || "").split(".");
         if (namePair.length == 2) {
             result.schemaName = namePair[0].replace(sqlQuoteRegex, "");
-            result.indexName = namePair[1].replace(sqlQuoteRegex, "");
+            result.indexName = namePair[1].replace(sqlQuoteRegex, "Stryker was here!");
         } else {
             result.schemaName = "";

[Killed] BlockStatement
src/utils/CommonHelper.js:1510:16
         if (namePair.length == 2) {
             result.schemaName = namePair[0].replace(sqlQuoteRegex, "");
             result.indexName = namePair[1].replace(sqlQuoteRegex, "");
-        } else {
-            result.schemaName = "";
-            result.indexName = namePair[0].replace(sqlQuoteRegex, "");
-        }
+        } else {}
 
         // tableName
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "index_name"
Received: ""

[Survived] StringLiteral
src/utils/CommonHelper.js:1512:67
             result.indexName = namePair[1].replace(sqlQuoteRegex, "");
         } else {
             result.schemaName = "";
-            result.indexName = namePair[0].replace(sqlQuoteRegex, "");
+            result.indexName = namePair[0].replace(sqlQuoteRegex, "Stryker was here!");
         }
 

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1516:29
         }
 
         // tableName
-        result.tableName = (matches[4] || "").replace(sqlQuoteRegex, "");
+        result.tableName = (false).replace(sqlQuoteRegex, "");
 
         // columns
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).replace is not a function

[Killed] LogicalOperator
src/utils/CommonHelper.js:1516:29
         }
 
         // tableName
-        result.tableName = (matches[4] || "").replace(sqlQuoteRegex, "");
+        result.tableName = (matches[4] && "").replace(sqlQuoteRegex, "");
 
         // columns
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,9 +7,9 @@
      },
    ],

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1519:29
         result.tableName = (matches[4] || "").replace(sqlQuoteRegex, "");
 
         // columns
-        const rawColumns = (matches[5] || "")
+        const rawColumns = (true)
             .replace(/,(?=[^\(]*\))/gmi, "{PB_TEMP}") // temporary replace comma within expressions for easier splitting
             .split(",");                              // split columns
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).replace is not a function

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1519:29
         result.tableName = (matches[4] || "").replace(sqlQuoteRegex, "");
 
         // columns
-        const rawColumns = (matches[5] || "")
+        const rawColumns = (false)
             .replace(/,(?=[^\(]*\))/gmi, "{PB_TEMP}") // temporary replace comma within expressions for easier splitting
             .split(",");                              // split columns
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).replace is not a function

[Killed] Regex
src/utils/CommonHelper.js:1520:22
 
         // columns
         const rawColumns = (matches[5] || "")
-            .replace(/,(?=[^\(]*\))/gmi, "{PB_TEMP}") // temporary replace comma within expressions for easier splitting
+            .replace(/,(?![^\(]*\))/gmi, "{PB_TEMP}") // temporary replace comma within expressions for easier splitting
             .split(",");                              // split columns
 
killedBy: CommonHelpers.parseIndex should return the correct columns 2 columns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
    Object {
      "collate": "",

[Survived] Regex
src/utils/CommonHelper.js:1520:22
 
         // columns
         const rawColumns = (matches[5] || "")
-            .replace(/,(?=[^\(]*\))/gmi, "{PB_TEMP}") // temporary replace comma within expressions for easier splitting
+            .replace(/,(?=[^\(]\))/gmi, "{PB_TEMP}") // temporary replace comma within expressions for easier splitting
             .split(",");                              // split columns
 

[Killed] BlockStatement
src/utils/CommonHelper.js:1523:37
             .replace(/,(?=[^\(]*\))/gmi, "{PB_TEMP}") // temporary replace comma within expressions for easier splitting
             .split(",");                              // split columns
 
-        for (let col of rawColumns) {
-            col = col.trim().replaceAll("{PB_TEMP}", ",") // revert temp replacement
-
-            const colRegex = /^([\s\S]+?)(?:\s+collate\s+([\w]+))?(?:\s+(asc|desc))?$/gmi
-            const colMatches = colRegex.exec(col);
-            if (colMatches?.length != 4) {
-                continue
-            }
-
-            const colOrExpr = colMatches[1]?.trim()?.replace(sqlQuoteRegex, "");
-            if (!colOrExpr) {
-                continue;
-            }
-            result.columns.push({
-                name:    colOrExpr,
-                collate: colMatches[2] || "",
-                sort:    colMatches[3]?.toUpperCase() || "",
-            });
-        }
+        for (let col of rawColumns) {}
 
         // WHERE expression
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

@@ -1,13 +1,7 @@
  Object {
-   "columns": Array [

[Survived] MethodExpression
src/utils/CommonHelper.js:1524:19
             .split(",");                              // split columns
 
         for (let col of rawColumns) {
-            col = col.trim().replaceAll("{PB_TEMP}", ",") // revert temp replacement
+            col = col.replaceAll("{PB_TEMP}", ",") // revert temp replacement
 
             const colRegex = /^([\s\S]+?)(?:\s+collate\s+([\w]+))?(?:\s+(asc|desc))?$/gmi

[Killed] Regex
src/utils/CommonHelper.js:1526:30
         for (let col of rawColumns) {
             col = col.trim().replaceAll("{PB_TEMP}", ",") // revert temp replacement
 
-            const colRegex = /^([\s\S]+?)(?:\s+collate\s+([\w]+))?(?:\s+(asc|desc))?$/gmi
+            const colRegex = /^([\s\S])(?:\s+collate\s+([\w]+))?(?:\s+(asc|desc))?$/gmi
             const colMatches = colRegex.exec(col);
             if (colMatches?.length != 4) {
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

@@ -1,13 +1,7 @@
  Object {
-   "columns": Array [
