[Killed] Regex
src/utils/CommonHelper.js:1526:30
         for (let col of rawColumns) {
             col = col.trim().replaceAll("{PB_TEMP}", ",") // revert temp replacement
 
-            const colRegex = /^([\s\S]+?)(?:\s+collate\s+([\w]+))?(?:\s+(asc|desc))?$/gmi
+            const colRegex = /^([\s\S]+?)(?:\s+collate\s+([\w]+))(?:\s+(asc|desc))?$/gmi
             const colMatches = colRegex.exec(col);
             if (colMatches?.length != 4) {
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

@@ -1,13 +1,7 @@
  Object {
-   "columns": Array [

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1528:17
 
             const colRegex = /^([\s\S]+?)(?:\s+collate\s+([\w]+))?(?:\s+(asc|desc))?$/gmi
             const colMatches = colRegex.exec(col);
-            if (colMatches?.length != 4) {
+            if (false) {
                 continue
             }
killedBy: CommonHelpers.parseIndex should return an empty array if there is no column
statusReason: TypeError: Cannot read properties of null (reading '1')

[Killed] OptionalChaining
src/utils/CommonHelper.js:1528:17
 
             const colRegex = /^([\s\S]+?)(?:\s+collate\s+([\w]+))?(?:\s+(asc|desc))?$/gmi
             const colMatches = colRegex.exec(col);
-            if (colMatches?.length != 4) {
+            if (colMatches.length != 4) {
                 continue
             }
killedBy: CommonHelpers.parseIndex should return an empty array if there is no column
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Survived] OptionalChaining
src/utils/CommonHelper.js:1532:31
                 continue
             }
 
-            const colOrExpr = colMatches[1]?.trim()?.replace(sqlQuoteRegex, "");
+            const colOrExpr = colMatches[1]?.trim().replace(sqlQuoteRegex, "");
             if (!colOrExpr) {
                 continue;

[Survived] OptionalChaining
src/utils/CommonHelper.js:1532:31
                 continue
             }
 
-            const colOrExpr = colMatches[1]?.trim()?.replace(sqlQuoteRegex, "");
+            const colOrExpr = colMatches[1].trim()?.replace(sqlQuoteRegex, "");
             if (!colOrExpr) {
                 continue;

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1533:17
             }
 
             const colOrExpr = colMatches[1]?.trim()?.replace(sqlQuoteRegex, "");
-            if (!colOrExpr) {
+            if (true) {
                 continue;
             }
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

@@ -1,13 +1,7 @@
  Object {
-   "columns": Array [

[Killed] BooleanLiteral
src/utils/CommonHelper.js:1533:17
             }
 
             const colOrExpr = colMatches[1]?.trim()?.replace(sqlQuoteRegex, "");
-            if (!colOrExpr) {
+            if (colOrExpr) {
                 continue;
             }
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

@@ -1,13 +1,7 @@
  Object {
-   "columns": Array [

[Killed] LogicalOperator
src/utils/CommonHelper.js:1538:26
             }
             result.columns.push({
                 name:    colOrExpr,
-                collate: colMatches[2] || "",
+                collate: colMatches[2] && "",
                 sort:    colMatches[3]?.toUpperCase() || "",
             });
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Object {
    "columns": Array [

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1538:26
             }
             result.columns.push({
                 name:    colOrExpr,
-                collate: colMatches[2] || "",
+                collate: false,
                 sort:    colMatches[3]?.toUpperCase() || "",
             });
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Object {
    "columns": Array [

[Killed] OptionalChaining
src/utils/CommonHelper.js:1539:26
             result.columns.push({
                 name:    colOrExpr,
                 collate: colMatches[2] || "",
-                sort:    colMatches[3]?.toUpperCase() || "",
+                sort:    colMatches[3].toUpperCase() || "",
             });
         }
killedBy: CommonHelpers.parseIndex should return the correct index name when the request is in lowercase
statusReason: TypeError: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1539:26
             result.columns.push({
                 name:    colOrExpr,
                 collate: colMatches[2] || "",
-                sort:    colMatches[3]?.toUpperCase() || "",
+                sort:    false,
             });
         }
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,11 +1,11 @@
  Object {
    "columns": Array [

[Killed] ConditionalExpression
src/utils/CommonHelper.js:1544:24
         }
 
         // WHERE expression
-        result.where = matches[6] || "";
+        result.where = false;
 
         return result;
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -9,7 +9,7 @@
    "indexName": "index_name",
    "optional": false,

[Killed] LogicalOperator
src/utils/CommonHelper.js:1544:24
         }
 
         // WHERE expression
-        result.where = matches[6] || "";
+        result.where = matches[6] && "";
 
         return result;
killedBy: CommonHelpers.parseIndex should make abstraction of the spaces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -9,7 +9,7 @@
    "indexName": "index_name",
    "optional": false,

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1558:13
     static buildIndex(indexParts) {
         let result = "CREATE ";
 
-        if (indexParts.unique) {
+        if (true) {
             result += "UNIQUE ";
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1558:13
     static buildIndex(indexParts) {
         let result = "CREATE ";
 
-        if (indexParts.unique) {
+        if (false) {
             result += "UNIQUE ";
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1564:34
 
         result += "INDEX ";
 
-        if (indexParts.optional) {
-            result += "IF NOT EXISTS ";
-        }
+        if (indexParts.optional) {}
 
         if (indexParts.schemaName) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1564:13
 
         result += "INDEX ";
 
-        if (indexParts.optional) {
+        if (true) {
             result += "IF NOT EXISTS ";
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1568:13
             result += "IF NOT EXISTS ";
         }
 
-        if (indexParts.schemaName) {
+        if (true) {
             result += `\`${indexParts.schemaName}\`.`;
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1568:13
             result += "IF NOT EXISTS ";
         }
 
-        if (indexParts.schemaName) {
+        if (false) {
             result += `\`${indexParts.schemaName}\`.`;
         }

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1572:24
             result += `\`${indexParts.schemaName}\`.`;
         }
 
-        result += `\`${indexParts.indexName || "idx_" + CommonHelper.randomString(7)}\` `;
+        result += `\`${true}\` `;
 
         result += `ON \`${indexParts.tableName}\` (`;

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1572:24
             result += `\`${indexParts.schemaName}\`.`;
         }
 
-        result += `\`${indexParts.indexName || "idx_" + CommonHelper.randomString(7)}\` `;
+        result += `\`${indexParts.indexName && "idx_" + CommonHelper.randomString(7)}\` `;
 
         result += `ON \`${indexParts.tableName}\` (`;

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1576:66
 
         result += `ON \`${indexParts.tableName}\` (`;
 
-        const nonEmptyCols = indexParts.columns.filter((col) => !!col?.name);
+        const nonEmptyCols = indexParts.columns.filter((col) => !col?.name);
 
         if (nonEmptyCols.length > 1) {

[NoCoverage] OptionalChaining
src/utils/CommonHelper.js:1576:67
 
         result += `ON \`${indexParts.tableName}\` (`;
 
-        const nonEmptyCols = indexParts.columns.filter((col) => !!col?.name);
+        const nonEmptyCols = indexParts.columns.filter((col) => !!col.name);
 
         if (nonEmptyCols.length > 1) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1578:13
 
         const nonEmptyCols = indexParts.columns.filter((col) => !!col?.name);
 
-        if (nonEmptyCols.length > 1) {
+        if (false) {
             result += "\n  ";
         }

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:1578:13
 
         const nonEmptyCols = indexParts.columns.filter((col) => !!col?.name);
 
-        if (nonEmptyCols.length > 1) {
+        if (nonEmptyCols.length >= 1) {
             result += "\n  ";
         }

[NoCoverage] StringLiteral
src/utils/CommonHelper.js:1579:23
         const nonEmptyCols = indexParts.columns.filter((col) => !!col?.name);
 
         if (nonEmptyCols.length > 1) {
-            result += "\n  ";
+            result += "";
         }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1582:45
             result += "\n  ";
         }
 
-        result += nonEmptyCols.map((col) => {
-                let item = "";
-
-                if (col.name.includes("(") || col.name.includes(" ")) {
-                    // most likely an expression
-                    item += col.name;
-                } else {
-                    // regular identifier
-                    item += ("`" + col.name + "`");
-                }
-
-                if (col.collate) {
-                    item += (" COLLATE " + col.collate);
-                }
-
-                if (col.sort) {
-                    item += (" " + c.sort.toUpperCase());
-                }
-
-                return item;
-            })
+        result += nonEmptyCols.map((col) => {})
             .join(",\n  ");
 

[NoCoverage] AssignmentOperator
src/utils/CommonHelper.js:1582:9
             result += "\n  ";
         }
 
-        result += nonEmptyCols.map((col) => {
-                let item = "";
-
-                if (col.name.includes("(") || col.name.includes(" ")) {
-                    // most likely an expression
-                    item += col.name;
-                } else {
-                    // regular identifier
-                    item += ("`" + col.name + "`");
-                }
-
-                if (col.collate) {
-                    item += (" COLLATE " + col.collate);
-                }
-
-                if (col.sort) {
-                    item += (" " + c.sort.toUpperCase());
-                }
-
-                return item;
-            })
-            .join(",\n  ");
+        result -= nonEmptyCols.map(col => {
+  let item = "";
+  if (col.name.includes("(") || col.name.includes(" ")) {
+    // most likely an expression
+    item += col.name;
+  } else {
+    // regular identifier
+    item += "`" + col.name + "`";
+  }
+  if (col.collate) {
+    item += " COLLATE " + col.collate;
+  }
+  if (col.sort) {
+    item += " " + c.sort.toUpperCase();
+  }
+  return item;
+}).join(",\n  ");
 
         if (nonEmptyCols.length > 1) {

[NoCoverage] LogicalOperator
src/utils/CommonHelper.js:1585:21
         result += nonEmptyCols.map((col) => {
                 let item = "";
 
-                if (col.name.includes("(") || col.name.includes(" ")) {
+                if (col.name.includes("(") && col.name.includes(" ")) {
                     // most likely an expression
                     item += col.name;

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1585:71
         result += nonEmptyCols.map((col) => {
                 let item = "";
 
-                if (col.name.includes("(") || col.name.includes(" ")) {
-                    // most likely an expression
-                    item += col.name;
-                } else {
+                if (col.name.includes("(") || col.name.includes(" ")) {} else {
                     // regular identifier
                     item += ("`" + col.name + "`");

[NoCoverage] AssignmentOperator
src/utils/CommonHelper.js:1587:21
 
                 if (col.name.includes("(") || col.name.includes(" ")) {
                     // most likely an expression
-                    item += col.name;
+                    item -= col.name;
                 } else {
                     // regular identifier

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1588:24
                 if (col.name.includes("(") || col.name.includes(" ")) {
                     // most likely an expression
                     item += col.name;
-                } else {
-                    // regular identifier
-                    item += ("`" + col.name + "`");
-                }
+                } else {}
 
                 if (col.collate) {

[NoCoverage] AssignmentOperator
src/utils/CommonHelper.js:1590:21
                     item += col.name;
                 } else {
                     // regular identifier
-                    item += ("`" + col.name + "`");
+                    item -= "`" + col.name + "`";
                 }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1593:34
                     item += ("`" + col.name + "`");
                 }
 
-                if (col.collate) {
-                    item += (" COLLATE " + col.collate);
-                }
+                if (col.collate) {}
 
                 if (col.sort) {

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1593:21
                     item += ("`" + col.name + "`");
                 }
 
-                if (col.collate) {
+                if (true) {
                     item += (" COLLATE " + col.collate);
                 }

[NoCoverage] AssignmentOperator
src/utils/CommonHelper.js:1594:21
                 }
 
                 if (col.collate) {
-                    item += (" COLLATE " + col.collate);
+                    item -= " COLLATE " + col.collate;
                 }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1597:31
                     item += (" COLLATE " + col.collate);
                 }
 
-                if (col.sort) {
-                    item += (" " + c.sort.toUpperCase());
-                }
+                if (col.sort) {}
 
                 return item;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1597:21
                     item += (" COLLATE " + col.collate);
                 }
 
-                if (col.sort) {
+                if (false) {
                     item += (" " + c.sort.toUpperCase());
                 }

[NoCoverage] MethodExpression
src/utils/CommonHelper.js:1598:36
                 }
 
                 if (col.sort) {
-                    item += (" " + c.sort.toUpperCase());
+                    item += (" " + c.sort.toLowerCase());
                 }
 

[NoCoverage] AssignmentOperator
src/utils/CommonHelper.js:1598:21
                 }
 
                 if (col.sort) {
-                    item += (" " + c.sort.toUpperCase());
+                    item -= " " + c.sort.toUpperCase();
                 }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1605:38
             })
             .join(",\n  ");
 
-        if (nonEmptyCols.length > 1) {
-            result += "\n";
-        }
+        if (nonEmptyCols.length > 1) {}
 
         result += `)`;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1605:13
             })
             .join(",\n  ");
 
-        if (nonEmptyCols.length > 1) {
+        if (true) {
             result += "\n";
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1611:31
 
         result += `)`;
 
-        if (indexParts.where) {
-            result += ` WHERE ${indexParts.where}`;
-        }
+        if (indexParts.where) {}
 
         return result;

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1611:13
 
         result += `)`;
 
-        if (indexParts.where) {
+        if (true) {
             result += ` WHERE ${indexParts.where}`;
         }

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1625:53
      * @param  {String} newTableName
      * @return {String}
      */
-    static replaceIndexTableName(idx, newTableName) {
-        const parsed = CommonHelper.parseIndex(idx);
-
-        parsed.tableName = newTableName;
-
-        return CommonHelper.buildIndex(parsed);
-    }
+    static replaceIndexTableName(idx, newTableName) {}
 
     /**

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1641:58
      * @param  {String} newColumn
      * @return {String}
      */
-    static replaceIndexColumn(idx, oldColumn, newColumn) {
-        if (oldColumn === newColumn) {
-            return idx; // no change
-        }
-
-        const parsed = CommonHelper.parseIndex(idx);
-
-        let hasChange = false;
-        for (let col of parsed.columns) {
-            if (col.name === oldColumn) {
-                col.name = newColumn;
-                hasChange = true;
-            }
-        }
-
-        return hasChange ? CommonHelper.buildIndex(parsed) : idx;
-    }
+    static replaceIndexColumn(idx, oldColumn, newColumn) {}
 }
 

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1642:38
      * @return {String}
      */
     static replaceIndexColumn(idx, oldColumn, newColumn) {
-        if (oldColumn === newColumn) {
-            return idx; // no change
-        }
+        if (oldColumn === newColumn) {}
 
         const parsed = CommonHelper.parseIndex(idx);

[NoCoverage] ConditionalExpression
src/utils/CommonHelper.js:1642:13
      * @return {String}
      */
     static replaceIndexColumn(idx, oldColumn, newColumn) {
-        if (oldColumn === newColumn) {
+        if (true) {
             return idx; // no change
         }

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1648:25
 
         const parsed = CommonHelper.parseIndex(idx);
 
-        let hasChange = false;
+        let hasChange = true;
         for (let col of parsed.columns) {
             if (col.name === oldColumn) {

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1649:41
         const parsed = CommonHelper.parseIndex(idx);
 
         let hasChange = false;
-        for (let col of parsed.columns) {
-            if (col.name === oldColumn) {
-                col.name = newColumn;
-                hasChange = true;
-            }
-        }
+        for (let col of parsed.columns) {}
 
         return hasChange ? CommonHelper.buildIndex(parsed) : idx;

[NoCoverage] BlockStatement
src/utils/CommonHelper.js:1650:41
 
         let hasChange = false;
         for (let col of parsed.columns) {
-            if (col.name === oldColumn) {
-                col.name = newColumn;
-                hasChange = true;
-            }
+            if (col.name === oldColumn) {}
         }
 

[NoCoverage] EqualityOperator
src/utils/CommonHelper.js:1650:17
 
         let hasChange = false;
         for (let col of parsed.columns) {
-            if (col.name === oldColumn) {
+            if (col.name !== oldColumn) {
                 col.name = newColumn;
                 hasChange = true;

[NoCoverage] BooleanLiteral
src/utils/CommonHelper.js:1652:29
         for (let col of parsed.columns) {
             if (col.name === oldColumn) {
                 col.name = newColumn;
-                hasChange = true;
+                hasChange = false;
             }
         }
